{
  "url": "https://nsrit.edu.in/computer-science-engineering-ds/",
  "title": "Computer Science & Engineering (DS) - NSRIT",
  "content": "Search for: Computer Science & Engineering (DS) NSRIT > Computer Science & Engineering (DS) Department Profile About the Department CSD-Magazines Faculty Faculty Profile Faculty Achievements Faculty Workshop/Seminar/FDP’s Laboratories Department Administration Research Activities Publications Projects Industrial Visits Resources Student Projects Syllabus E-Resources Advanced Learning Professional Societies – Activities Technical Club Department Gallery MoUs Student Achievements Academics Roll of Honour Academic Toppers Co-Curricular Activities Extracurricular Activities Others Contact Us ABOUT THE DEPARTMENT The Department of Computer Science and Engineering (Data Science) was established in the year 2020 with an intake of 30. In the year 2022 the intake was increased to 60 and currently the number of seats in the department is 60.This specialized B.Tech program was introduced to meet the growing demand for professionals with skills in data-driven technologies, analytics, and intelligent systems.\n\nThe curriculum for the B.Tech in Computer Science and Engineering (Data Science) is crafted in line with the academic guidelines of AICTE, UGC, and the Andhra Pradesh State Council of Higher Education (APSCHE) under the Regulation 2020 framework. It follows a Choice-Based Credit System (CBCS) integrated within a semester-based academic structure, ensuring adaptability and depth in learning. The curriculum emphasizes a multi-disciplinary approach, incorporating inputs from global professional bodies such as the ACM, IEEE, and aligns with the standards prescribed by NBA and the ABET’s Engineering Accreditation Commission (EAC).\n\nIn addition, the curriculum and syllabi are systematically developed through a structured feedback mechanism that actively incorporates insights from a diverse range of stakeholders, including industry professionals, potential employers, alumni, academic experts, professional bodies, research institutions, and parents. This inclusive approach ensures the program remains relevant, contemporary, and aligned with both academic standards and industry expectations.With the institute integrated into the Academic Bank of Credits (ABC) system, students are provided with greater academic flexibility to earn and transfer credits toward the completion of their B.Tech degree , including pathways for Regular, Honors, and Minor specializations . VISION To become Centre of excellence for technically competent, innovative computer engineers. MISSION To provide quality education and spread professional & technical knowledge, leading to a career as computer professionals in different domains of industry, governance and academia. To provide state-of-art environment for learning and practice. To impart hands on training in latest methodologies and technologies as per industry requirements. PROGRAM EDUCATIONAL OBJECTIVE (PEOs) : Continue to demonstrate the application of the knowledge of data science to solve real-time engineering challenges in the tech landscape that use programming abilities, statistical analysis of data, build and assess data-based models, statistical analysis and data management in addition to the application of fundamental and conceptual knowledge of computer science and engineering Sustain their satisfactory professional career in their own start-ups or as a team member/team lead in an IT or allied industry Engage in self-directed learning and advanced studies based on the demand driven need of the industries and their interest for their professional and career accomplishments PROGRAM OUTCOMES(POs) The POs are the transactional statements of graduate attributes (GAs) that each graduating engineer should possess in terms of knowledge, skill and behavior with a minimum target performance level at the time of graduation as fixed by the program of study seeking continuous improvement year on year.The graduates of Computer Science and Engineering of NSRIT will be able to demonstrate the following outcomes in terms knowledge, skill and behavioral competencies at the time of graduation with the expected target performance level Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems.(Engineering knowledge) Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences. (Problem Analysis) Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations. (Design/Development of Solutions) Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions. (Conduct investigations of complex problems) Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations.(Modern Tool Usage) Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice.(The engineer and society) Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development. (Environment and Sustainability) Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice. (Ethics) Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings. (Individual and Team Work) Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. (Communication) Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments. (Project management and finance) Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. (Life-Long Learning) PROGRAMME SPECIFIC OUTCOMES (PSOs) Design and develop intelligent systems by applying analytical and programming skills to solve real world and engineering problems. Ability to apply the knowledge of computing tools and techniques in the field of Data Science for solving real world problems encountered in the Software Industries maintaining the professional standards and ethics. ×"
}