{
  "url": "https://nsrit.edu.in/computer-science-engineering/cse-gallery/",
  "title": "CSE-Gallery - NSRIT",
  "content": "Search for: CSE-Gallery NSRIT > Computer Science & Engineering > CSE-Gallery Department Profile About the Department CSE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Club Extra Curricular Activities Placements Laboratories Program Specific Lab Details Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy CSE-Startups Industrial Intraction Department MOUs CSE Internships Industrial Visits Learning Resources CSE-Materials CSE-Self Reflection Videos CSE-Alumni Department Gallery Contact Us Department Gallery Top 10 of the Wi-SUN Smart City challenge 2024, organized by IIIT Hyderabad, Out of 266 participating teamsInstitute of Information Technology Mr Hari Kiran and Team III CSE secured Second Prize in Internal Smart India Hackathon 2024 Conducted at NSRIT, Visakhapatnam Mr M Kowshik and Team III CSE secured Third Prize in Internal Smart India Hackathon 2024 Conducted at NSRIT, Visakhapatnam Mr Hari Kiran and Team from III CSE Secured Second Prize and won cash prize 1500  in VISTA, Visakhapatnam Conducted by Vignan Institute Mr. Vijay, Mr. Shanmuk and Mr Rahul from IV CSE got First Prize in hackhub with cash award of ₹15,000 at Stepcon conducted by GMRIT Mr. Vijay, Mr. Shanmuk and Mr Rahul from IV CSE got First Prize in hackhub with cash award of ₹15,000 at Stepcon conducted by GMRIT Mr M.Venkata Sameerand Team from II CSE Secured Second Prize and won cash prize 1500  in Tech Vison, Visakhapatnam Mr J Sampreeth and team Secured Second Prize and won cash prize 8,000 in Hackwith Nellore Conducted by Audisankara Ms Y Navya Shanthi and Team II CSE secured Second Prize and won cash prize 5,000 in Hack with Vizag 2.0 Conducted at NSRIT,Visakhapatnam Mr J Sampth Kumar and Team Secured Third Prize and won cash prize 5,000 in Hackwith Nellore Conducted by Audisankara engineering Mr.K Jaya Vardhan and team Secured Third Prize and cash prize 5,000 in Hackwith Nellore Conducted by Audisankara Mr.Chaitanya and team of CSE got first prize in 16-HOURS HACKATHON &CODING CHALLENGES WITH DSA AT RGUKT (IIIT srikakulam) with a Cash award of ₹5,000 Mr.Mohan and team of 3rd year CSE secured first prize in reverse coding competition conducted by Miracle College of engineering Students of III CSE secured first prize in the Reverse Coding event conducted by Miracle Engineering College! Mr.Chaitanya,Mr.Sai Kumar secured Third Prize, along with cash award of ₹5,000 at AI Autonomous Hackathon Conducted by V R Sidhartha Engineering college. 4th place at the event \"SKY THRUST “Conducted by \"IIT HYDERABAD \" And got an offer of an internship with the company \"UNISTRING TECH SOLUTIONS \". Mr. Vijay, Mr. Shanmuk and Mr Rahul IV CSE secured First prize, along with a cash award of ₹20,000 at the Citizen Hack Digital Summit conducted by Miracle Software solutions ×"
}