{
  "url": "https://nsrit.edu.in/computer-science-engineering/",
  "title": "Computer Science & Engineering - NSRIT",
  "content": "Search for: Computer Science & Engineering NSRIT > Computer Science & Engineering Department Profile About the Department CSE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Club Extra Curricular Activities Placements Laboratories Program Specific Lab Details Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy CSE-Startups Industrial Intraction Department MOUs CSE Internships Industrial Visits Learning Resources CSE-Materials CSE-Self Reflection Videos CSE-Alumni Department Gallery Contact Us ABOUT THE DEPARTMENT The Department of Computer Science and Engineering (CSE) was established in 2008 with an initial intake of 60 students. The intake capacity was increased to 120 in 2010, 180 in 2023, and will further expand to 300 from the Academic Year 2024–2025. The CSE Department takes pride in announcing that our institution has been accredited with an ‘A’ grade by NAAC, and the department itself is accredited by the National Board of Accreditation (NBA) under TIER-II. VISION To become a center of excellence for technically competent and innovative computer professionals through a strong emphasis on teaching, research, industry engagement by inculcating ethical and moral values. MISSION M1 : To provide quality education leading to a career as computer professionals M2 : To provide state-of-art learning environment that fosters industry collaboration and societal empowerment. M3 : To nurture research, ethical and moral values through practical training as per industry requirements. PROGRAM EDUCATIONAL OBJECTIVES (PEO’s) PEO #1: To produce graduates who will establish themselves as skilled professionals by leveraging their foundational and conceptual knowledge of Computer Science and Engineering to excel in their chosen IT and allied industries. PEO #2: To produce graduates for advanced studies or sustainable careers, including the creation and management of their own start-ups. PEO #3: To produce graduates who demonstrate leadership skills and uphold ethical values while contributing effectively to their choosen career paths. PROGRAM OUTCOMES (POs) 1. Engineering knowledge: Apply the knowledge of mathematics,science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems. 2. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences,and engineering sciences. 3. Design/Development of Solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations. 4. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions. 5. Modern Tool Usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations. 6. The Engineer and Society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice. 7. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development. 8. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice. 9. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings. 10. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. 11. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments. 12. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. PROGRAM SPECIFIC OUTCOMES (PSO’s) PSO1: Able to apply the theoretical knowledge of Computer Science and Engineering and the foundational principles of software development to provide sustainable solutions for the real world technical challenges in the tech landscape by maintaining professional standards, ethical values and integrity. PSO2: Able to adapt to technological changes by initiating self-paced learning to meet the industry\ndemands. SHORT TERM GOALS 1. To strengthen the department infrastructure and human resources. 2. To achieve 100% results. 3. To organize more soft skill programs to meet Industry needs. 4. To motivate the students towards academic activities. 5. To encourage the staff for developing good academic skills 6. Secure University ranks and gold medals every year. 7. To achieve a minimum of 90% pass in all subjects. 8. To establish and strengthen Industry Institute Interaction. 9. To enhance research and development by increasing the number of collaborative projects and programs. 10. To impart academic and professional competency in our students. 11. To conduct technical and personality development programs for the students. LONG TERM GOALS 1. To provide a strong R&D base by undertake research projects and consultancy works. 2. To have greater interaction with reputed industrial and R&D organizations. 3. To make the department strong with all teaching staff qualified with Doctorate degrees and specialized in different areas of Electronics and Communication Engineering. 4. To achieve 100% results . 5. To achieve 100% placements / higher studies. 6. Conducting bridge courses regarding the upcoming trends in software. 7. Conducting seminars by eminent personalities to explore the core subjects in-depth. 8. Conducting Industrial Tours to the students. 9. Activating students to do Mini projects at semester breaks. 10. Sending students to various institutional, regional and national level technical paper presentations. 11. To encourage the students to become entrepreneurs. 12. conduct at least one faculty development program every semester. 13. To conduct National and International conferences regularly. 14. To conduct seminars and workshops regularly. ×"
}