{
  "url": "https://nsrit.edu.in/electrical-electronics-engineering/eee-department-mous/",
  "title": "EEE Department MOU’s - NSRIT",
  "content": "Search for: EEE Department MOU’s NSRIT > Electrical & Electronics Engineering > EEE Department MOU’s Department Profile About the Department EEE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects EEE-Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Clubs Extracurricular Activities Placements Laboratories Program Specific Labs EEE-Industry Supported Laboratories Department Administration Research EEE Publications Projects &Consultancy eee-startups Industrial Interaction Department MOU’s EEE Internships Industrial Visits Learning Resources EEE-Materials EEE-Self Reflection Videos Advanced Learning Alumni Department Gallery Contact Us List of MOUs Signed so far S.No Name of the Industry, Institute  or Research Organization Date of Signing MOU Activities Carried out/Undertaken 1 Centre of Excellence in Maritime and Shipbuilding (CEMS) 23 rd Dec, 2024 Facilitate guest lectures by SMEs from industries. oriented programs. Knowledge enrichment beyond the curriculum by facilitating the licensed software 2 Morris Garages 1 st May, 2024 Faculty Development Programs. Add on courses 3 Skill Lync Chennai 14 th July, 2023 To Train students in MATLAB 4 M/s Vihaan Electric & Tech Team Solutions 7 th July, 2023 Establishing adequate setup with laboratory facilities in the designated space. To train the students in a better way in their chosen career path. Facilitate 20-30% placement opportunities to the trained students either in Vihaan Electrix or Tech Team solutions 5 Tierra Automation, Visakhapatnam 8 th May, 2023 Support for Curriculum Design. Internships and placements Skill Development programs Provides Industry Trainers to enrich the skills and knowledge of students. Guest Lectures and FDPs Industrial training and visits. 6 Demy Software Solutions 21 st Dec, 2022 Coding related trainings Internships 7 Clicks Talent Connect Pvt. Ltd 28 th Oct, 2022 Hackathons Live projects Skill development programs Placement opportunities Internships Certification programs. 8 National Institute of Technical Teachers’ Training and Research, Chennai (NITTTR) 17 th Oct, 2022 Faculty Development programs on Teaching Pedagogy Support for Curriculum Design. Knowledge Enhancement on Open Book Examinations, Outcome based education reflecting LOT and HOT. To train the faculty in continuous assessment practices, Academic Audit and Accreditation procedures. 9 HMI Engineering Services, Visakhapatnam 10thAug, 2022 Skill Development programs Established Industry supported laboratory in a multidisciplinary approach. Guest Lectures, Faculty Development programs. Research and development on Machine Learning & Python programming. Internships and placements Support for Curriculum Design. Industrial training and visits. Provides Industry Trainers to enrich the skills and knowledge of students. 10 Vihaan Electrix, Visakhapatnam 27th April, 2022 Support for Curriculum Design. Internships and placements Research and development on EV technologies and battery management systemSkill Development programs Established Industry supported laboratory in a multidisciplinary approach. Guest Lectures, Faculty Development programs.Provides Industry Trainers to enrich the skills and knowledge of students. Industrial training and visits. 11 Tech Team Solutions 27 th April, 2022 Established Industry supported laboratory in a multidisciplinary approach. Provides Industry Trainers to enrich the skills and knowledge of students. Industrial training and visits. Support for Curriculum Design. Internships and placements Research and development on Embedded systems, IOT, Robotics, AI & ML Skill Development programs  Guest Lectures, Faculty Development programs. 12 Tilicho Labs 12 th March2022 Provide Expert Talk Internships for Faculty and Students Placement support. Support for Curriculum Design ×"
}