{
  "url": "https://nsrit.edu.in/electronics-communication-engineering/",
  "title": "Electronics & Communication Engineering - NSRIT",
  "content": "Search for: Electronics & Communication Engineering NSRIT > Electronics & Communication Engineering Department Profile About the Department ECE-Magazines Faculty Faculty List Particpations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Extracurricular Activities Placements Laboratories Program Specific Laboratories ECE-Industry Supported Laboratories Department Administration Research Activities Publications Projects & Consultancy ECE-Startups Industrial Visits Department MoUs ECE Internships ECE-Industrial Visits Learning Resources ECE-Materials ECE-Self Reflection Videos ECE-Alumni Department Gallery Contact Us ABOUT THE DEPARTMENT The Department of Electronics and Communication Engineering was established in the year 2008 with an initial intake of 60 in UG Programme B.Tech (Electronics and Communication Engineering). It was increased to 90 in the year 2009, and from the year 2010 to 2022, the intake was 120. It was increased to 180 in 2023 and a new UG Programme B. Tech (Electronics Engineering in VLSI Design and Technology) was introduced. Later, the seats were increased to 240 in the ECE Programme and Post Graduation Programme M.Tech in VLSI Design and mbedded Systems with an intake of 12 was also started in the year 2024. The Under Graduate Programme Electronics and Communication Engineering was accredited by National Board of Accreditation (NBA) in the year 2022 under TIER-II. The Department consists of experienced faculty who are experts in their own disciplines, aimed at educating, training and mentoring the students with sound knowledge and awareness of latest trends in Electronics and Communication Engineering. Faculty are involved in research and published their research works in reputed Journals and Conferences. The Department has good laboratory facilities to infuse practical knowledge to the students on par with academic excellence. Vision To become recognized forerunner in Electronics and Communication Engineering by producing competent and responsible graduates.. Mission To prepare technically competent graduates by establishing a conducive learner centric academic environment that uses innovative teaching learning processes To create research interests in the graduates by bringing in real time engineering challenges through industry collaborations To make the graduates socially responsible citizens who provide sustainable solutions maintaining ethical and professional standards PROGRAM EDUCATIONAL OBJECTIVES (PEO’s) PEO #1: Our graduates will solve real world problems of 21st Century in Electronics and\nCommunication Engineering with a satisfactory professional growth and required\nskills. PEO #2: Our graduates will be able to pursue higher studies and engage in lifelong learning to adapt to evolving technologies and career demands PEO #3: Our graduates will demonstrate ethical behavior and social responsibility in their\nprofessional work. PROGRAM OUTCOMES (POs) Engineering knowledge: Apply the knowledge of mathematics, science, engineering fundamentals, and an engineering specialization to the solution of complex engineering problems. Problem analysis: Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences. Design/development of solutions: Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations. Conduct investigations of complex problems: Use research-based knowledge and research methods including design of experiments, analysis and interpretation of data, and synthesis of the information to provide valid conclusions. Modern tool usage: Create, select, and apply appropriate techniques, resources, and modern engineering and IT tools including prediction and modelling to complex engineering activities with an understanding of the limitations. The engineer and society: Apply reasoning informed by the contextual knowledge to assess societal, health, safety, legal and cultural issues and the consequent responsibilities relevant to the professional engineering practice. Environment and sustainability: Understand the impact of the professional engineering solutions in societal and environmental contexts, and demonstrate the knowledge of, and need for sustainable development. Ethics: Apply ethical principles and commit to professional ethics and responsibilities and norms of the engineering practice. Individual and team work: Function effectively as an individual, and as a member or leader in diverse teams, and in multidisciplinary settings. Communication: Communicate effectively on complex engineering activities with the engineering community and with society at large, such as, being able to comprehend and write effective reports and design documentation, make effective presentations, and give and receive clear instructions. Project management and finance: Demonstrate knowledge and understanding of the engineering and management principles and apply these to one’s own work, as a member and leader in a team, to manage projects and in multidisciplinary environments. Life-long learning: Recognize the need for, and have the preparation and ability to engage in independent and life-long learning in the broadest context of technological change. PROGRAM SPECIFIC OUTCOMES (PSO’s) PSO 1: To demonstrate the ability to design and develop complex systems in the areas of next generation Communication Systems, IoT based Embedded Systems, Advanced Signal and Image Processing, latest Semiconductor technologies, RF and Power Systems PSO 2: To demonstrate the ability to solve complex Electronics and Communication Engineering problems using latest hardware and software tools along with analytical skills to contribute to useful, frugal and eco-friendly solutions. SHORT TERM GOALS To strengthen the department infrastructure and human resources. To achieve 100% results. To organize more soft skill programs to meet Industry needs. To motivate the students towards academic activities. To encourage the staff for developing good academic skills Secure University ranks and gold medals every year. To achieve a minimum of 90% pass in all subjects. To establish and strengthen Industry Institute Interaction. To enhance research and development by increasing the number of collaborative projects and programs. To impart academic and professional competency in our students. To conduct technical and personality development programs for the students. LONG TERM GOALS To provide a strong R&D base by undertake research projects and consultancy works. To have greater interaction with reputed industrial and R&D organizations. To make the department strong with all teaching staff qualified with Doctorate degrees and specialized in different areas of Electronics and Communication Engineering. To achieve 100% results . To achieve 100% placements / higher studies. Conducting bridge courses regarding the upcoming trends in software. Conducting seminars by eminent personalities to explore the core subjects in-depth. Conducting Industrial Tours to the students. Activating students to do Mini projects at semester breaks. Sending students to various institutional, regional and national level technical paper presentations. To encourage the students to become entrepreneurs. conduct at least one faculty development program every semester. To conduct National and International conferences regularly. To conduct seminars and workshops regularly. ×"
}