{
  "url": "https://nsrit.edu.in/founders/",
  "title": "Founders - NSRIT",
  "content": "Search for: Founders NSRIT > Founders Home Recruitment About Us History Vision-Mission-Quality Policy Institutional Policies Strategic Plan Strategic Priorities Stakeholder-engagment-framework Institutional Performance Indicators President’s Message Founders Why NSRIT Leadership Principal’s Message CMo’s Message RTI Information Campus Life Clubs Facilities Computer Center Library Seminar Hall Transport Cafteria & Hostel Talent Incubation Center Makers Space Design Space Recording Studio Other Facilities Sports NSS & YRC Newsletter Administration Organizational Chart Governing Body Academic Council Finance Committee Institutional Committee(s) Audited Statements AICTE Approvals AICTE-EOA(2025-26) Admissions Admissions 2025 – 2026 Courses Offered Fee Structures Admission policy and process Details Circulars Autonomous Outcome Based Education Academic Regulations Curriculum & Syllabi Pedagogy and Learning Methodologies Academic calendar Controller of Examination ABC Policy Document Institutions Under ABC SOP (ABC) -NSRIT ABC Grievance Redressal Cell List of Courses (Under ABC) ABC Awareness Videos Video – 1 Video – 2 Video – 3 Video – 4 Academics Civil Engineering Mechanical Engineering Electrical & Electronics Engineering Electronics & Communication Engineering Computer Science & Engineering Computer Science & Engineering (AI & ML) Computer Science & Engineering (DS) S & H MBA MCA Faculty Faculty Professional Development Certifications Student Certifications Professional Certifications Accreditation & Ranking IQAC Annual quality assurance reports Campus land and buildings Barrier free and indusive access Environmental sustainability Centre of excellence NAAC Certificate NBA Accreditation Orders QS I-GAUGE NIRF NIRF-Overall Ranking NIRF-Engineering NIRF-Management NIRF-Innovation IIC Entrepreneurship and startup support Patents-Innovations-Startups Intellectual property and innovation cell IIE Academic Partnership Industry integrated courses Internship opportunities R&D Profile Core Team Research Infrastructure Projects Research Areas Consultancy Services Contact Us Quick Links Website Navigation AICTE IDEA LAB Placements Objective Placement Policy Placement Summary Placement Brochure Trainers Placement Gallery Contact T & P Pay Fees Youtube Channel Student Alumini Founders S.No. Name of the Promoter Designation 1 Sri. N. Satyanarayana Raju President 2 Smt. N.Padmavathi Vice-President 3 Dr. N. Prasada Raju Secretary 4 Sri. N. Krishnam Raju Joint Secretary 5 Sri. N. Kanaka Raju Treasurer 6 Smt. Ch. Indira priya darshini Executive Member 7 Smt. K. R. V. P. Sandya Executive Member 8 Sri. K. Sitaramanjanaya Raju Executive Member 9 Smt. Komala Devi Executive Member ×"
}