{
  "url": "https://nsrit.edu.in/leadership/",
  "title": "Leadership - NSRIT",
  "content": "Search for: Leadership NSRIT > Leadership Home Recruitment About Us History Vision-Mission-Quality Policy Institutional Policies Strategic Plan Strategic Priorities Stakeholder-engagment-framework Institutional Performance Indicators President’s Message Founders Why NSRIT Leadership Principal’s Message CMo’s Message RTI Information Campus Life Clubs Facilities Computer Center Library Seminar Hall Transport Cafteria & Hostel Talent Incubation Center Makers Space Design Space Recording Studio Other Facilities Sports NSS & YRC Newsletter Administration Organizational Chart Governing Body Academic Council Finance Committee Institutional Committee(s) Audited Statements AICTE Approvals AICTE-EOA(2025-26) Admissions Admissions 2025 – 2026 Courses Offered Fee Structures Admission policy and process Details Circulars Autonomous Outcome Based Education Academic Regulations Curriculum & Syllabi Pedagogy and Learning Methodologies Academic calendar Controller of Examination ABC Policy Document Institutions Under ABC SOP (ABC) -NSRIT ABC Grievance Redressal Cell List of Courses (Under ABC) ABC Awareness Videos Video – 1 Video – 2 Video – 3 Video – 4 Academics Civil Engineering Mechanical Engineering Electrical & Electronics Engineering Electronics & Communication Engineering Computer Science & Engineering Computer Science & Engineering (AI & ML) Computer Science & Engineering (DS) S & H MBA MCA Faculty Faculty Professional Development Certifications Student Certifications Professional Certifications Accreditation & Ranking IQAC Annual quality assurance reports Campus land and buildings Barrier free and indusive access Environmental sustainability Centre of excellence NAAC Certificate NBA Accreditation Orders QS I-GAUGE NIRF NIRF-Overall Ranking NIRF-Engineering NIRF-Management NIRF-Innovation IIC Entrepreneurship and startup support Patents-Innovations-Startups Intellectual property and innovation cell IIE Academic Partnership Industry integrated courses Internship opportunities R&D Profile Core Team Research Infrastructure Projects Research Areas Consultancy Services Contact Us Quick Links Website Navigation AICTE IDEA LAB Placements Objective Placement Policy Placement Summary Placement Brochure Trainers Placement Gallery Contact T & P Pay Fees Youtube Channel Student Alumini Why NSRIT ? Why NSRIT (Autonomous)? Reasons beyond imagination! Education Empowered! Accredited by NAAC with ‘A’ grade The program of CSE, ECE and Mech. Engg. is accrdedired by National Board of Accreditation (NBA) QS I Gauge certified institution Recognized NSRIT as “A” Grade Institute by Govt of Andhra Pradesh 100% admission attracting premium ranks through EAPCET based merit scholarship schemes by NSRIT Industry sponsored laboratory B. Tech. (Minor) with specialization in AI, Machine Learning and Data Science B. Tech. (Part time) in CSE, CSE (AL & ML) and CSE (Data Science) for working professionals Best – in – class placement with premium placement offers ranging upto Rs. 39 LPA band Hire and train model for premium placement offers Intenships with pre-placement offers with stipend from 3rd year onwards (PAN India) Strong industry connect with industries and institutiions of national repute On Job Training (OJT) with salary perks Learning Management System On campus Boys and Girls hostel separately Modern Pedagogy for improving the Teaching-Learning Process Industry driven one credit courses every week from 2nd year onwards Best – in – class mentoring systems with students Guest Lectures/Seminars by eminent persons. Personality development, motivation and training classes by experts. Workshops, Symposiums and Technical fest conducted by student’s technical associations like VECTA, SEA, ADVAYA, ACME & Robotic Club. Startup Bootcamp at NSRIT which would function as an idea Clinic mini incubator. Professional affiliations like ACM, ASME, SAE, ISTE, IEEE, CSI, IE(I) etc…. State-of-art Labs 24×7 dispensary facility within campus. NSRIT has a strong Entrepreneurship Development Cell (EDC) to enhance Industry Relations & Placement Department and has been consistent in achieving 100% Placements for registered eligible students. A separate student welfare and guidance division headed by dean-student welfare. 300 Mbps hi-speed internet connectivity round the clock in the campus and in the hostels. Discipline is the hallmark with 100% ragging free environment. Innovative Clubs to encourage the student’s creativity like Technology forums & hobby clubs for students. Excellent facilities for all kinds of indoor & outdoor games & sports with coaches for all major games & sports. R&D Cell for exposing to latest developments and create spectrum of contemporary technologies to faculties and students. ×"
}