{
  "url": "https://nsrit.edu.in/mba/mba-department-administration/",
  "title": "MBA Department Administration - NSRIT",
  "content": "Search for: MBA Department Administration NSRIT > MBA > MBA Department Administration Profile Faculty Faculty Profile Faculty Achievements Faculty Workshop/Seminar/FDP’s Laboratories Department Administration Research Activities Publications Projects Industrial Visits Advanced Learning Resources MBA Lecture Notes MBA Syllabus Professional Societies Technical Club Department Gallery Department MoUs Student Achievements Student Academics Roll of Honor Academic Toppers Co-Curricular Activities Extracurricular Activities Student Activities MBA Contact Us Department Administration DEPARTMENT GRIVIENCE AND REDRESSIAL COMMITTEE (DGRC) Responsibilities The students approach this cell to voice their grievances regarding academic and non academic matters. The cell redresses the grievances at individual and class level grievances of common interest. Students are encouraged to use the suggestion box placed on the campus to express constructive suggestions and grievances. Complaints dropped in the suggestion box by students and oral complaints are also redressed. The department assures students that one’s a complaint is made, it will be treated with confidentiality. COMITTEE MEMBERS: Dr.V.Bala Professor, – HOD,Chair person. Mrs.K.Nandini,Assistant Professor. Mrs.A.Madhavi Latha, Assistant Professor. Mrs.D.Madhuri, Assistant Professor. Mrs T.Nagalakshmi, Assistant Professor. DEPARTMENT ADVISORY COMMITTEE (DAC) Responsibilities Suggest improvement in academic plans and recommend standard practices/systems for attainment of PEO’s & Encourage for industry-institute interactions to bridge up curriculum/industry gap and suggest quality improvement initiatives to enhance employability. Redefine existing PEO’s, aligning of PEO’s to the mission statements and defining program specific outcomes. To propose necessary action plan for skill development of students, required for entrepreneurship development and quality improvement. To identify and suggest thrust areas to conduct various activities (final year projects, training courses and additional experiments to meet PEO’s). Bringing industry standards in academic in order to bridge gap between industry and academics. Improving department by its structure and its academics by understanding the current and former students need by their parents and alumni respectively and Departmental queries which expects advice to consider enhancing the departmental business process. Committee Members: Dr.V.BALA – HOD , Professor, Chair person Dr.P.Vishnu Mahesh, Professor. Mr. T.Narayana Rao ,Assistant Professor Mrs.A.Madhavi Latha ,Assistant Professor Mrs.K.Nandini ,Assistant Professor DEPARTMENT BUDGET AND RESOURCE COMMITTEE (DBRC) Responsibilities Get budget for academic year wise and consolidate for submission to accounts. Monitor use of funds and ensure records are maintained both at the lab and office department. Solicit and scrutinize budget for seminars/guest lectures etc., from the organizing faculty before finalizing and keep a record of the same in department. For any additional unexpected resource requirements, plan for getting approval. Discuss and take action for sanction of any additional resource not envisaged in the budget if need arises. Committee Members Dr.V.BALA – HOD, Professor, Chair person. Dr.P.Vishnu Mahesh, Professor. Mr. T.Narayana Rao, Assistant Professor. Mrs.A.Madhavi Latha Assistant Professor. Mrs.K.Nandini Assistant Professor. DEPARTMENT PROJECT REVIEW COMMITTEE (DPRC) Responsibilities Finalize student groups and topics in II year IV Semester. Review and approve the projects Monitor the progress with students during the duration of project. Approving project submission. Internal evaluation at the end of the project. Submit copies of project reports to library. Collect titles and synopsis from faculty and ensure entry of these in Project Compendium. Committee Members: Dr.V.BALA ,Professor, HOD, Chair person. Mr. T.Narayana Rao, Assistant Professor. Mrs.A.Madhavi Latha, Assistant Professor. Mrs.K.Nandini, Assistant Professor. Mrs.D.Madhuri, Assistant Professor. DEPARTMENT LIBRARY COMMITTEE (DLC) Responsibilities Prepare a list of books of relevance and also of Journals/magazines with price for getting them to Library. Obtain necessary approval and plan for procurement. Intimate students/staff regarding availability and new arrivals on regular basis. Maintain accession register and issue register. Committee Members: Dr.V.Bala, Professor, HOD, Chair person. Mrs D.Madhuri, Assistant Professor. Mrs.A.Madhavi Latha, Assistant Professor. Mrs.K.Nandini, Assistant Professor. Mrs T.Nagalakshmi, Assistant Professor. DEPARTMENT RESEARCH COMMITTEE (DRC) Responsibilities Identify thrust areas and specific topics on which to work further. Identify the faculty who would be working on those areas. Decide if the same can be applied for funding or to request management for funding. Identify funding agencies, forward applications and maintain records. Draw action plan for implementation and monitor the same. Committee Members: Dr.V.BALA , Professor, HOD,Chair person. Dr.P.Vishnu Mahesh, Professor. Mrs.A.Madhavi Latha, Assistant Professor. Mrs.K.Nandini , Assistant Professor. Mr. T.Narayana Rao, Assistant Professor. DEPARTMENT RELATIONSHIP MANAGEMENT COMMITTEE (DRMC) Responsibilities To receive and attend the parents. guardians in the college. To inform about the low attendance, poor marks of the students , if any, to the concerned parents. Committee Members: Dr.V.BALA, Professor, HOD, Chair person. Mr. T.Narayana Rao, Assistant Professor. Mrs T.Nagalakshmi, Assistant Professor. Mrs.K.Nandini, Assistant Professor. Mrs.A.Madhavi Latha, Assistant Professor. PROGRAM ASSESSMENT COMMITTEE (PAC) Responsibilities Monitoring the achievements of programme outcomes (PO’s),Pragramme specific outcomes (PSO’s),and Programme Educational Outcomes (PEO’s),Course outcomes (CO’s),and propose necessary changes for the attainment of PO’s and PEO’s. Assessment data will be gathered and reported as per assessment cycle. The committee will create an assessment cycle to ensure that all PO’s,PSO’s are being assessed in a regionalble time period. Review submitted assessment plans and reports, Recommend revisions as appropriate. Verify that assessment results have been used for programmatic improvements. To remind update about current and knowledgeable assessment tools, practices and guidelines. Interact with students, faculty and other stake holders in facilitating PEO’s. Track status and report of work assigned to individual and bring out in notice to DAC. Committee Members Dr.V.BALA, Professor, HOD, Chair person. Dr.P.Vishnu Mahesh, Professor. Mr. T.Narayana Rao, Assistant Professor. Mrs.A.Madhavi Latha, Assistant Professor. Mrs.D.Madhuri, Assistant Professor. ×"
}