{
  "url": "https://nsrit.edu.in/rd-projects/",
  "title": "R&D Projects - NSRIT",
  "content": "Search for: R&D Projects NSRIT > R&D Projects R&D Profile Core Team Projects Research Areas Contact Us Sno Title of Project Principal Investigator Funding Agency Funding Worth (Rs) Status 1 Experimental Study of “Influences of pulsed and non-pulsed current Gas Tungsten Arc Welding(GTAW) on 6082 Aluminum Alloy Weldments” Dr. B.V.R.Ravi Kumar, Professor of ME & Principal AICTE, New Delhi 15,70,000/- Completed and Submitted to AICTE 2 Comparative study of “Weld characteristics of IS:65032A aluminum alloy by two processes friction stir welding (FSW) and Gas Tungsten Arc Welding (GTAW)” Dr. B.V.R.Ravi Kumar, Professor of ME & Principal DRDO (CARS) 9,91,100/- Work is in Progress 3 Microstructure and corrosion behaviour of precipitation hardened and thermo mechanical treated high strength Al-12Zn-3Mg-2.5Cu alloy in order to reduce the grain size of with addition AA7xxx+Sc Dr. VV Ravi kumar [ME] COINVESTIGATOR Mr. P V S MURALI KRISHNA [ME] SERB Reference No : 242018001516 Duration of project will be three years Rs. 44,85,000 Applied 11-08-2018 4 Research Promotion Scheme Dr. VV Ravi kumar (Dept of ME) AICTE Application Id 1-7101998421 Duration of project will be three years Rs. 25,00,000 ME, R=NR+R1 Total = 12,11,764.00 Applied 31-12 -2019 5 FDP Dr. VV Ravi kumar (Dept of ME) AICTE Application Id 1-7097258991 Duration of project will be three years Rs. 7,00,000 ME, R=NR+R1 Total = 3,05,000.00 Applied 1-1 -2020 6 STTP V. S. Roja Ramani (Dept of ECE) AICTE Application Id 1-7116933111 Duration of STTP will be One week Rs. 5,00,000 ECE, R=NR+R1 Total = 4,31000.00 Applied 3-1 -2020 7 STTP Dr. K. MADHAVI (Dept of CSE) AICTE Application Id 1-7116986269 Duration of STTP will be One week Rs. 5,00,000 CSE, R=NR+R1 Total = 2,66,000.00 Applied 3-1-2020 8 FDP Dr. T. Sri Ram (Dept of CSE) AICTE Application Id 1-7116951952 Duration of project will be three years Rs. 7,00,000 CSE, R=NR+R1 Total = 3,16,000.00 Applied 3-1 -2020 9 MODROBS Dr. S. V. Uma Maheswara Rao (Dept of ME) AICTE Application Id 1-7119870081 Duration of project will be two years Rs. 20,00,000 ME, R=NR+R1 Total = 6,44,705.00 Applied 4-1-2020 10 STTP Dr. R. S. R. Krishnam Naidu (Dept of EEE) AICTE Application Id 1-7123625681 Duration of STTP will be One week Rs. 5,00,000 CSE, R=NR+R1 Total = 3,46,700.00 Applied 4-1-2020 11 MODROBS Dr. R. S. R. Krishnam Naidu (Dept of EEE) AICTE Application Id 1-7124491369 Duration of project will be two years Rs. 20,00,000 ME, R=NR+R1 Total = 8,00,000.00 Applied 5-1-2020 12 DST Project Proposal On “Establishment of Scheduled Tribe Cell” SEED- Scheduled Tribe Sub Plan Investigator Dr. VV Ravi kumar [ME] Co-Investigator Dr. S V UMA MAHESWARA RAO [ME] DST Regis-No. : TPN / 47205 Duration of project will be two years Rs. 1536000-00 Applied 15-02-2020 UGC Minor Research Projects 1 Cooperative privacy game:A privacy model for social networking using cooperative game theory Srinivasa chakravarthy.L, Asst Prof, Dept of CSE UGC 4,98,000 Applied 2 Estimation of trace element concentrations in Indian medicinal plants by using analytical techniques N.Giridhar babu , Asst Prof, Dept of S&H UGC 2,75,000 Applied 3 Wireless sensor network monitoring of water characteristics of fish pond for possible disease risk evaluation for commercial aqua farms, Kakinada, east Godavari district- a case study Kiran Kumar Kalyana, Assoc Prof, Dept of EEE UGC 4,97,000 Applied 4 Optimization of embedded computing algorithms implemented through FPGA A.Ramakrishna, Assoc Prof, Dept of ECE UGC 4,98,000 Applied 5 Experimental Investigations over the extraction of bio-diesel from Micro-Algae and its implementation as an alternative fuel Dr.Pothula Ramesh Babu, Professor, Dept of ME UGC 4,98,000 Applied 6 Microstructure and corrosion behaviour of precipitation hardened and thermo-mechanical treated high strength Al-12Zn-3Mg-2.5Cu alloy in order to reduce the grain size of with addition AA7xxx+Sc Dr. V V RAVI KUMAR SERB Rs. 44,85,000/- Applied 7 Nickel base Alloy With Metal Matrix Composite Zirconium Boride With Inorganic Coatings For High Temperature Environments. Dr. V.V. RaviKumar, Assoc. Professor,Department of Mechanical Engineering. Department of Science and Technology 48,00,000 Applied on 01/03/2019 8 Share And Mentor Institutions (Margdarshan) Dr. K. Madhavi (Dept of CSE), Dr. VV Ravi kumar (Dept of ME) AICTE Rs. 50,00,000 Applied (Nov -2018) 9 Nickel base Alloy With Metal Matrix Composite Zirconium Boride With Inorganic Coatings For High Temperature Environments Dr. VV Ravi kumar [ME] COINVESTIGATOR Dr. S. V. UMA MAHESWARA RAO [ME] SERB Reference No. : 422019002178 Rs. 21,60,000 Applied 27-04-2019 10 Modernization And Removal Of Obsolescence (Modrob) Dr. VV Ravi kumar (Dept of ME) AICTE Application Id 1-6323165598 Duration of project will be two years Rs. 20,00,000 ME, R=NR+R1 Total = 13,41,000.00 Applied 26-08 -2019 11 Modernization And Removal Of Obsolescence (Modrob) Dr. T.V.S.SRI RAM (Dept of CSE) AICTE Application Id 1-6332777041 Duration of project will be two years Rs. 20,00,000 CSE, R=NR+R1 Total = 14,11,000.00 Applied 27-08 -2019 12 Modernization And Removal Of Obsolescence (Modrob) Mr. N. SRIKANTH (Dept of ECE) AICTE Application Id 1-6334128721 Duration of project will be two years Rs. 20,00,000 CSE, R=NR+R1 Total = 13,23,000.00 Applied 27-08 -2019 ×"
}