{
  "url": "https://nsrit.edu.in/rd-research-areas/",
  "title": "R&D Research Areas - NSRIT",
  "content": "Search for: R&D Research Areas NSRIT > R&D Research Areas R&D Profile Core Team Projects Research Areas Contact Us Research Thrust Areas Computer Science and Engineering Sno Faculty Designation Research Interests 1 Dr R. Srinivas Professor Image Processing & Machine Learning 2 Dr R. Priya Vijayanthi Professor Machine Learning & Deep Learning 3 Mrs J. Santoshi Kumari Assistant Professor Web Technolgies & Computer Networks 4 Dr K. Madhavi Professor Data Sciene & Data Mining 5 Mr K. Shankar Associate Professor Computer Networks & Data Warehouse 6 Dr V. Sreerama Murthy Professor Computer Vision & Image Processing 7 Dr B. Ravi kiran Professor Computer Vision & Image Processing 8 Dr TVS Sriram Associate Professor Data Mining and Warehouse & Computer Networks 9 Mrs P.kavya Assistant Professor Computer Networks 10 Mr T. Ravi Kumar Assistant Professor Web Technolgies & Machine Learning 11 Mr N. V. Reddy Sr Asst. Professor Software Engineering & Network Security 12 Mr A. Suraj Assistant Professor Cyber Security & Networking 13 Mr shaik Jhani Assistant Professor Cyber Security & Data Analytics 14 Ms G. Hari Keerthana Assistant Professor Data Analytics 15 Ms P. Mounika Assistant Professor Machine Learning 16 Ms P. Sahithi Assistant Professor Data Analytics 17 Mrs M. Bhargavi Assistant Professor Web Technolgies 18 Mrs Khadarunnisa Assistant Professor Cloud Computing 19 Mrs A. Kamala Priya Assistant Professor Machine Learning 20 Mrs S. Jaya prada Sr Assistant Professor Machine Learning & Computer Networks 21 Ms G. Aparanjini Assistant Professor Computer Networks Electronics and Communication Engineering Sno Faculty Designation Research Interests 22 Mrs. M.V.S. Roja ramani Asst. Prof. Signal processing, Embedded Systems 23 Sri R.Kumara Swamy Asst. Prof. Embedded Systems 24 Sri D.Rahul Asst. Prof. Embedded Systems 25 Ms B.Sravani Asst. Prof. Image processing 26 Sri K.V.E. Sarojini Asst. Prof. Signal processing Mechanical Engineering Sno Faculty Designation Research Interests 27 Dr. S. V. UMA MAHESWARA RAO PROFESSOR PRODUCTION INVENTORY MODELS 28 Sri P.V.Murali Krishna Assoc Professor Thermal energy systems 29 Dr. V V RAVI KUMAR ASSOCIATE PROFESSOR MATERIAL SCIENCE Electrical and Electronics Engineering Sno Faculty Designation Research Interests 30 Sri B.V.Veeranjaneyulu Asst. Prof. Power electronics & drives, Facts ,Power systems dynamics Science & Humanities Sno Faculty Designation Research Interests 31 Dr. N.Giridhar Babu Asst Prof (Physics) Nuclear Analytical technics, Radiation spectroscopy 32 K.S.D.L.Kalyan Prasad Asst Prof (Physics) Atmospheric sciences, Stratospheric ozone studies 33 M.G.Varaprasad Asst Prof (Mathematics) Cryptography,Number theory 34 K.Ramaprasad Asst Prof (Mathematics) Universal Algebra ,Lattice theory 35 M. Prashanthi Asst Prof (English) Writing skills in terms of employability ×"
}