{
  "url": "https://nsrit.edu.in/s-h/",
  "title": "S & H - NSRIT",
  "content": "Search for: S & H NSRIT > S & H Dept Profile Faculty List Faculty Participations & Achievements Student’s Corner Academic Toppers Professional Societies – Activities SH-Skill Oriented Courses Co-Curricular Activities Extracurricular Activities S & H Laboratories Department Administration Research Activities Publications Learning Resources SH-Materials SH-Self Reflection Videos Department Gallery Contact Us ABOUT THE DEPARTMENT The department of Science and Humanities is an epitome of expertise and an amalgamation of assorted streams of Mathematics, English, Physics, Chemistry and Environmental studies. The Department has taken great strides in enriching students through application oriented learning, student seminars, e-lectures of NPTEL and MIT etc., to bridge the gap between Intermediate and Professional/Technical education. Technology Aided Language lab at NSRIT enables students to actively engage in interactive learning, enhancing their language skills through group discussions, presentations, debates, JAM sessions etc. At the outset, collaborative learning gives an opportunity to ameliorate the quality of this language proficiency, communication skills and soft skills. The department’s faculty, comprising 13 doctorates 2 pursuing Doctorates, 1M.Phil and 2 CSIR-UGC NET/APSET qualified faculty members. It holds the most prestigious R&D Lab for Mathematics and faculty also holds the guide ship in guiding the research scholars. Faculty members have published research papers, conference papers in various National and International reputed journals and conferences. Many of the faculty members have received Best Teacher Awards, Best Paper Awards, Vishista seva, and Seva awards for excellence in academics, research and service from reputed institutions and universities. Department has put forth many efforts to ensure the Holistic Development of students. It encourages student participation in various co-curricular and extra-curricular activities. Our students have participated and won awards/prizes at National and International level events. The Department as a whole inculcates team work and strongly feels that the will to win, the desire to succeed, and the urge to reach our full potential are the keys that unlocked the doors to our professional excellence. Goals of the Department Inculcating moral values and enhancing life skills. I Improving overall pass-percentage in academics. Improving the communication & presentation skills. Sustain up-to-date knowledge to bridge the gap between intermediate knowledge and engineering expertise. Preparing the students for meeting the present demands of industry & society. Improvement of Research and Development activi ties. Attain good recognition by publishing international research publications in peer Reviewed international journals Strengths’ of the Department: 100 percent Admissions Strong Foundation for Engineering Faculty Expertise Effective Mentoring System Student Centric Teaching Application Oriented Teaching Interdisciplinary Connections Research Opportunities ×"
}