{
  "url": "https://nsrit.edu.in/s-h/s-h-faculty-profile/",
  "title": "S & H Faculty Profile - NSRIT",
  "content": "Search for: S & H Faculty Profile NSRIT > S & H > S & H Faculty Profile Dept Profile Faculty List Faculty Participations & Achievements Student’s Corner Academic Toppers Professional Societies – Activities SH-Skill Oriented Courses Co-Curricular Activities Extracurricular Activities S & H Laboratories Department Administration Research Activities Publications Learning Resources SH-Materials SH-Self Reflection Videos Department Gallery Contact Us Department Faculty S.No FACULTY NAME QUALIFICATION DESIGNATION 1 Dr. V. Krishna Ph.D Professor & HOD 2 Dr N.V.V.S.Suryanarayana Ph.D Professor 3 Dr U. V. Subbarao Ph.D Professor 4 Dr. M. A. Rahamatulla Ph.D Associate Professor 5 Dr.K.S.D.L. Kalyan Prasad Ph.D Associate Professor 6 Dr M. Prasanthi Ph.D Associate Professor 7 Dr V. Sita Rama Raju Ph. D Associate Professor 8 Dr K.V.V.Satyanarayana Ph. D Assistant Professor 9 Dr B. Syam Kumar Ph.D Assistant Professor 10 Dr. E. Madhavi Ph.D Assistant Professor 11 Dr N. Gunadevi Ph.D Assistant Professor 12 Dr P. Peddi Naidu Ph. D Assistant Professor 13 Dr Y. Kusuma Kumari M.A, Ph.D Assisstant Professor 14 Mr P. Paripurna Chari M. Phil Assistant Professor 15 Ms V. Aishwarya Sree M. A Assistant Professor 16 Mrs B. Sujatha M. Sc, B. Ed Professor 17 Mr Ch.Dilleswara Rao M.P. Ed Physical Director 18 Ms A. Lavanya M. Sc Assistant Professor 19 Mrs M.Rama Chaitnya M. A Assistant Professor 20 Mr S. Veerabrahmam M. Sc Assistant Professor 21 Mrs N.V.S Pallavi M.Sc Assistant Professor 22 Ms P. Geetha M. sc Assistant Professor 23 Ms B. Mohini Devi M. Sc Assistant Professor 24 Mr Y. Revathi Krishna M. A Assistant Professor 25 Ms D. Sandhya Rani M. A Assistant Professor 26 Ms V. K Maha Lakshmi M. A Assistant Professor 27 Ms R. D.Jyothsna M. A Assistant Professor 28 Mr P. Gangadhar M. Sc Assistant Professor 29 Mrs G. Swapna M. Sc Assistant Professor 30 Mr K. Santosh Kumar M. Sc Assistant Professor 31 Mr A. Ananad Kumar M. Sc Assistant Professor 32 Mr D. Surya Narayana M. PEd Assistant Professor 33 Ms K. Shanthi Kumari M. Sc Assistant Professor 34 Ms V. Deva Preethi M. Sc Assistant Professor 35 Mrs K. Sarada M. Sc Assistant Professor 36 Mrs G. Gowthami M. Sc Assistant Professor 37 Mrs G. Lavanya M. Sc Assistant Professor 38 Mr D. Koteswara Rao M. PEd Assistant Professor 39 Mr Nishanth Patnaik M. Sc Assistant Professor 40 Mr P. Mahesh M. Sc Assistant Professor 41 Mr T. Venkata Raju M.A, M.L.I.Sc Assistant Professor & Librarian 42 Mr R. Chinna Rao M. Li. Sc Assistant Professor 43 Mrs P. V. Nagamani M. Sc Assistant Professor 44 Ms B. Sravani Beharani M. Sc Assistant Professor 45 Ms Y.Uma Nookaratnam M. Sc Assistant Professor 46 Mrs S.Kalpna M. Sc Assistant Professor 47 Mrs K. Udaya M. Sc Assistant Professor 48 Dr. Swathi Yandamuri Ph.D Associate Professor ×"
}