{
  "url": "https://nsrit.edu.in/campus-life/facilities/library/",
  "title": "Library - NSRIT",
  "content": "Search for: Library NSRIT > Campus Life > Facilities > Library Computer Center Library Seminar Hall Transport Cafteria & Hostel Sports Recording Studio Talent Incubation Center Design Space Makers Space Other Facilities Central Library To make life at NSRIT pleasant and comfortable for its students, the Campus is provided with the finest facilities and educational resources, which is established in the year 2008. The Library is one of the important facilities well developed with Digital Library and Reprographic facilities. This is equipped with new library software which helps in systematic organization of the library. Students can easily find books through OPAC. Journal section and Reference section equipped with advanced journals is a special attraction for the library. The library is offering the following service. S.R. Ranganathan Five Laws of Library Science Books are for use. Every reader his [or her] book. Every book its reader. Save the time of the User. The library is a growing organism. Library Collection Book Titiles : 4147 Journals/Magazines(Print):National/International : 137(106/31) Book Volumes : 20178 Book Bank Books for SC Students : 261 Donated/Complimentary Books : 766/690 Journals Back Volumes : 523 CDs/DVDs : 1544 NPTEL Lectures : 4310 Project Reports : 1591 Question Papers(all branches) : 490 News Paper Clippings(different subjects) : 91 E-Journals(IEEE,DELNET,NDL etc.,) : Available E-Books(DELNET,NDL etc., : Available NSRIT(A) Academic Regulations, Course Structure and Detailed Syllabus : Available Competitive Books(General,Gate,ESE,IES etc.,) : Available Library General Timings : 8.30 AM – 7.00 PM Borrow 3 Books for B.Tech,M.Tech,M.B.A and 2 Books for Diploma for a period of 14 Days. Access Reference Books and Periodicals. Issue of CDs,DVDs. Provied NPTEL Video Lecturers. Staff Membership Entitles Can Borrow 8 Books for a maximum period of one year. Access Reference Books and Periodicals. Issue of CDs,DVDs. Provied NPTEL Video Lectures The following rules shall be observed by every student Every student shall automatically become member of the Library. Strict silence should be observed in and around the Library. Personal belongings such as files, folders, note-books, drawing sheets, records, printed books etc. will not be allowed inside the Library. The students should keep them outside in the place earmarked for the purpose. If they are taken inside the Library, they will be confiscated and treated as library property. Entry into the Library is only on production of the identity card. Every student shall be issued two books at a time against the two tickets provided by the Library. All the books borrowed should be returned and the borrower’s tickets should be surrendered to the Library when one ceases to be a member of the library and for obtaining the no due certificate. The last borrower will be held responsible for any damage for the book borrowed. Borrowed books are not permitted to be taken inside the library unless they are to be returned. Books borrowed shall be returned in good condition and before the due date, failing which, fine shall be levied as per the rules of the library. The premises of the library shall be kept clean and the users shall not indulge in gossip, sleeping, smoking or any act of indiscipline. If any member is found indulging in such activities, the matter shall be reported to the Principal for necessary action to be taken against the member. If any member is found stealing any book or journal or indulging in any kind of mutilation, severe action leading to forfeiture of library membership shall be taken. For the benefit of the students, the Library is kept open till 5-30 p.m Know More About Library(Click Here) ×"
}