{
  "url": "https://nsrit.edu.in/campus-life-2/",
  "title": "Campus Life - NSRIT",
  "content": "Search for: Campus Life NSRIT > Campus Life Home Recruitment About Us History Vision-Mission-Quality Policy Institutional Policies Strategic Plan Strategic Priorities Stakeholder-engagment-framework Institutional Performance Indicators President’s Message Founders Why NSRIT Leadership Principal’s Message CMo’s Message RTI Information Campus Life Clubs Facilities Computer Center Library Seminar Hall Transport Cafteria & Hostel Talent Incubation Center Makers Space Design Space Recording Studio Other Facilities Sports NSS & YRC Newsletter Administration Organizational Chart Governing Body Academic Council Finance Committee Institutional Committee(s) Audited Statements AICTE Approvals AICTE-EOA(2025-26) Admissions Admissions 2025 – 2026 Courses Offered Fee Structures Admission policy and process Details Circulars Autonomous Outcome Based Education Academic Regulations Curriculum & Syllabi Pedagogy and Learning Methodologies Academic calendar Controller of Examination ABC Policy Document Institutions Under ABC SOP (ABC) -NSRIT ABC Grievance Redressal Cell List of Courses (Under ABC) ABC Awareness Videos Video – 1 Video – 2 Video – 3 Video – 4 Academics Civil Engineering Mechanical Engineering Electrical & Electronics Engineering Electronics & Communication Engineering Computer Science & Engineering Computer Science & Engineering (AI & ML) Computer Science & Engineering (DS) S & H MBA MCA Faculty Faculty Professional Development Certifications Student Certifications Professional Certifications Accreditation & Ranking IQAC Annual quality assurance reports Campus land and buildings Barrier free and indusive access Environmental sustainability Centre of excellence NAAC Certificate NBA Accreditation Orders QS I-GAUGE NIRF NIRF-Overall Ranking NIRF-Engineering NIRF-Management NIRF-Innovation IIC Entrepreneurship and startup support Patents-Innovations-Startups Intellectual property and innovation cell IIE Academic Partnership Industry integrated courses Internship opportunities R&D Profile Core Team Research Infrastructure Projects Research Areas Consultancy Services Contact Us Quick Links Website Navigation AICTE IDEA LAB Placements Objective Placement Policy Placement Summary Placement Brochure Trainers Placement Gallery Contact T & P Pay Fees Youtube Channel Student Alumini Principal’s Message Dr S. Sambhu Prasad Dr S. Sambhu Prasad , is currently Principal of Nadimpalli Satyanarayana Raju Institute of Technology , Sontyam (V), Visakhapatnam (India). Dr.S.Sambhu Prasad is an enthusiastic teacher and an able administrator and having more than 3 decades of experience in engineering education. He nurtured and shaped many young aspirants towards success in the current competitive scenario with utmost dedication and determination. He did his Ph.D in Mechanical Engineering, post graduation (M.E) in Industrial Engineering and graduation (B.E) in Mechanical (Marine as an elective) Engineering from Andhra University. He did his MBA (HR and Finance dual specialization) from Sambalpur University. He was a Student of Sainik School Korukonda. He received Gold Medal in B.E, first rank in M.E, National Award for the best article published in the Industrial Engineering Journal. He started his career as an Assistant Professor in GITAM College of Engineering and served the institution for 10 years 8 months. Dr.S.Sambhu Prasad played senior leadership roles in educational institutions with his expertise in HR for more than 18 years as Principal, Dean and Director. He was associated with  Raghu Engineering College for a period of 4 years as Professor. He started his administrative career as Principal in Raghu Engineering College. Subsequently he served as Principal of IACR Engineering College at Rayagada for 1 year 9 months and Roland Institute of Technology at Berhampur for 3 years in Odisha. He had longest association with Pragati Engineering College for a period of 11 years 4 months (as Principal for 9 years 5 months and Director for 1 year 11 months). During his tenure as Principal of Pragati Engineering College, i) 5 UG programmes i.e EEE,ME,ECE,CSE and IT received NBA Accreditation for a period of 3 years i.e from 1 st July 2021 to 30 th June 2024; ii) ECE, CSE & Mechanical Engineering departments for the academic years 2018-2019&2019-2020 and EEE department for the academic years 2019-2020&2020-2021 are recognized as Research Centers by JNTUK, Kakinada; iii) The College was conferred with Fresh Autonomous status by UGC in 2016 and iv) The College was accreditated with ‘A’ grade by NAAC in 2015. As Director of Pragati Engineering College, he focused on i) Strengthening Innovations, Startups and Entrepreneurship; ii) Strengthening Industry Connect; iii) Implementation of various AICTE Initiatives ; iv) accreditation related works with regard to NAAC, NBA, NIRF, ARIIA & IIC and initiated student driven Industry 4.O clubs. Dr.S. Sambhu Prasad handled many positions in his journey as Member Secretary of Governing Body, Chairman of Academic Council, Chairman of Finance Committee of Pragati Engineering College (Autonomous). He is paper setter and member of board of examiners to Andhra University and Sri Venkateswara University, JNTUK, Kakinada.He is a man of vision and meticulous in his nature in framing the curriculum as a BOS member of various reputed educational institutions. He is an Adjudicator for Ph.D. /M.Tech Thesis. Under his active research guidance, one student was awarded Ph.D and some students completed M.Tech projects. He completed 2 projects and one in one project he was Co-Investigator in Pragati Engineering College. He published 3 patents and published 39 research papers in international / national journals. He has professional memberships in 7 organizations. He had organized 3 FDP’s/Seminars/ Webinars and reviewed some papers. Dr.S. Sambhu Prasad  is a social activist and served the society through NCC& NSS cells of various colleges. The essence of technical and managerial education pivots around the skill development of the students, which are imparted in the most formidable manner in our campus. The earnest zeal to tower the pinnacles of the reputable fields is fueled by the unparalleled teaching prowess and state-of-art facilities of ours. With the ardent notion of building effervescent engineering communities, we took the leap in transforming the juvenile minds to intellectual brains. Our efforts to foster the technological advancements on this globe, have earned the respect of the international circles as well. We believe that the world can headway to the coming decades, only by suave management and technological reforms. Our campus continuously proving to be a virtue for our graduates in the real time environment. Dr S. Sambhu Prasad, Professor & Principal. To Know More About Principal’s Profile ×"
}