{
  "url": "https://nsrit.edu.in/civil-engineering/department-administration/",
  "title": "Department Administration - NSRIT",
  "content": "Search for: Department Administration NSRIT > Civil Engineering > Department Administration Department Profile About the Department Faculty Faculty List Faculty Achievements FDP/Workshop/Seminar Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Clubs Extracurricular Activities Placements Laboratories Department Administration Research Activities Publications Projects Industrial Visits Resources Syllabus E-Resources Advanced Learning Department Gallery Department MOU’S Contact us Department Administration Several committees have been constituted to make the administration -general, as well as academic, more transparent and de-centralized under the supervision of Mr. D. V. Shanmukesh , HOD. They are: DEPARTMENT GRIEVANCE & REDRESSAL COMMITTEE (DGRC): Responsibilities: The students approach the Cell to voice their grievances regarding academic and non academic matters. The cell redresses the grievances at individual and class level and grievances of common interest. Students are encouraged to use the suggestion box placed on the campus to express constructive suggestions and grievances. Complaints dropped in the ‘Suggestion Box’ by students and oral complaints are also redressed. The Department assures students that once a complaint is made, it will be treated with confidentiality. The committee shall meet Monthly once & whenever required. Committee members : Mr. B. Ramesh Chandra – Associate Professor & HOD Mr. P .Haragopal – Assistant Professor Mr. G. Chanikya – Assistant Professor Mr. T. Naidu – Assistant Professor Mr. S. Lovaraju – Assistant Professor DEPARTMENT LIBRARY COMMITTEE (DLC) : Responsibilities: Prepare a list of books of relevance and also of Journals/magazines with price for getting them to Library. Obtain necessary approval and plan for procurement. Intimate students/staff regarding availability and new arrivals on regular basis. Maintain accession register and issue register. The committee shall meet twice in a semester. Committee members : Mr. D. V. Shanmukesh – Sr. Gr Assistant Professor & HOD Mr.P.Haragopal – Assistant Professor Mr.G.Chanikya-Assistant Professor Mr. S. Lovaraju – Assistant Professor Mr. M. Saikiran – Assistant Professor DEPARTMENT RESEARCH COMMITTEE (DRC): Responsibilities: Identify thrust areas and specific topics on which to work further. Identify the faculty who would be working on those areas. Decide if the same can be applied for funding or to request management for funding. Identify funding agencies, forward applications and maintain records. Draw action plan for implementation and monitor the same. The committee shall meet twice in a semester. Committee members : Mr. D. V. Shanmukesh – Sr. Gr Assistant Professor& HOD Dr. G. Kalyani – Associate Professor Mr. P .Haragopal – Assistant Professor Mr. G. Chanikya – Assistant Professor Mr. T. Naidu – Assistant Professor DEPARTMENT RELATIONSHIP MANAGEMENT COMMITTEE (DRMC): Responsibilities: To receive and attend the parents / guardians in the college. To inform about the low attendance or poor Marks of the students, if any, to the concerned Parents. The committee shall meet Monthly once. Committee members : Mr. D. V. Shanmukesh – Sr. Gr Assistant Professor & Hod Mr. P .Haragopal – Assistant Professor Mrs. T. Prasanthi – Assistant Professor Mr. S. Lovaraju – Assistant Professor Mr. T. Naidu – Assistant Professor DEPARTMENT PROJECT REVIEW COMMITTEE (DPRC) : Responsibilities: Finalize student groups and topics in IV year I Semester. Review and approve the projects Monitor the progress with student groups three times during the duration of project. Approving project submission. Internal evaluation at the end of the project. Identify best projects. Submit copies of project reports to library. Collect titles and synopsis from faculty and ensure entry of these in Project Compendium. Ensure entry of best projects in Project Arcade. The committee shall meet twice in a semester. Committee members : Mr. D. V. Shanmukesh – Sr. Gr. Assistant Professor & HOD Dr. G. Kalyani – Associate Professor Mr. P. Haragopal – Assistant Professor Mr. G. Chanikya – Assistant Professor Mrs. S. Lovaraju – Assistant Professor PROGRAM ADVISORY COMMITTEE (PAC) Responsibilities: Monitoring the achievements of Program Outcomes (POs), Program Specific Outcomes (PSOs) and Program Educational Objectives (PEOs), Course Outcomes(COs)  and proposes necessary changes for the attainment of PEOs and POs. Assessment data would be gathered and reported as per assessment cycle. The committee will create an assessment cycle to ensure that all POs, PSOs are being assessed in a reasonable time period. Review submitted assessment plans and reports and recommend revisions as appropriate. Verify that assessment results have been used for programmatic improvements (close the loop). To remain update about current and knowledgeable assessment tools, practices and guidelines. Interact with students, faculty and other stakeholders in facilitating PEOs. Track status and report of work assigned to individual & bring out in notice to DAC. The committee shall meet twice in a semester. Committee members : Mr. D. V. Shanmukesh – Sr. Gr Assistant Professor & HOD Mr. P. Haragopal – Assistant Professor Mr. G. Chanikya-Assistant Professor Dr. G. Kalyani – Associate Professor Mrs. T. Prasanthi – Assistant Professor DEPARTMENT BUDGET AND RESOURCE COMMITTEE (DBRC) : Responsibilities: Get budget for academic year wise and consolidate for submission to accounts. Monitor use of funds and ensure records are maintained both at the lab and office department. Solicit and scrutinize budget for seminars/guest lectures etc., from the organizing faculty before finalizing and keep a record of the same in department. For any additional unexpected resource requirements, plan for getting approval. Discuss and take action for sanction of any additional resource not envisaged in the budget if need arises. The committee shall meet Monthly once. Committee members : Mr. D. V. Shanmukesh – Sr. Gr Assistant Professor & HOD Mr. P. Haragopal – Assistant Professor Mr. G. Chanikya – Assistant Professor Mr. M. Saikiran – Assistant Professor Mr. T. Naidu – Assistant Professor ×"
}