{
  "url": "https://nsrit.edu.in/computer-science-engineering/cse-mous/",
  "title": "CSE-MOUs - NSRIT",
  "content": "Search for: CSE-MOUs NSRIT > Computer Science & Engineering > CSE-MOUs Department Profile About the Department CSE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Club Extra Curricular Activities Placements Laboratories Program Specific Lab Details Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy CSE-Startups Industrial Intraction Department MOUs CSE Internships Industrial Visits Learning Resources CSE-Materials CSE-Self Reflection Videos CSE-Alumni Department Gallery Contact Us List of MOUs Signed so far S.No Name of the Industry, Institute or Research Organization Date of Signing MOU Activities Carried out/Undertaken 1 NITTTR 14.10.2022 Faculty Development programs on Teaching Pedagogy Support for Curriculum Design. Knowledge Enhancement on Open Book Examinations, Outcome based education reflecting LOT and HOT. To train the faculty in continuous assessment practices, Academic Audit and Accreditation procedures. 2 IIT Bombay Spoken Tutorial 31.10.2024 facilitate training on certification courses for students and faculty 3 ICT Academy 18.10.2024 providing FDPs,SDPs Providing Online certification courses for faculty and students. 4 providing FDPs,SDPs                         2.Providing Online certification courses for faculty and students. Internships Workshops Guest Lectures 4 NASSCOM 13.03.2023 Facilitates the registration process in NASSCOMs Future Skills online Platform for students and faculty Helps to enrich the knowledge in their chosen career path Enable diagnostics, badging and assessments to learners. 5 Tilicho  Labs 12.03.2022 Provide Expert Talk Internships for Faculty and Students Placement support. Support for Curriculum Design 6 Demy Software Solutions 21.12.2022 coding related trainings Internships. 7 AXIOM IO 25.09.2021 . Provide Expert Talk Internships for Faculty and Students Support for Curriculum Design OJTs& Preplacement offers. 8 Buddica Smart Life India Private Limited 03.01.2022 Industry driven one credit course for CSE & allied branches. Support for Curriculum Design Internships for students Guest Lectures from SMEs. Industry Visits Capacity development and skill enhancement activities 9 Imaginnovate Tech solutions (India) private. Limited 01.04.2021 Support for Curriculum Design. Placement support Internships for Faculty and Students 10 HMI Engineering Services 03.01.2022 Established Industry supported laboratory in a multidisciplinary approach. Provides Industry Trainers to enrich the skills and knowledge of students. Industrial training and visits. Support for Curriculum Design. Internships and placements Research and development on Machine Learning & Python programming. Skill Development programs Guest Lectures, Faculty Development programs. 11 HMIES SOLUTIONS (OPC)  Private Limited 25.10.2024 Established Industry supported laboratory in a multidisciplinary approach. Provides Industry Trainers to enrich the skills and knowledge of students. Industrial training and visits. Support for Curriculum Design. Internships and placements Research and development on cognitive Automation & Artificial Intelligence/Machine Learning Data science/Robotics Skill Development programs Guest Lectures, Faculty Development programs. 12 PROTINIX GLOBAL FOUNDATION 10.02.2025 supporting the Launch of startups provide infrastructure for startups Upskilling in the domains of PCB Design and IOT 13 INDIAN BIOMEDICAL SKILL CONSORTIUM 15.02.2025 . Internships with 4 months duration in 3D printing, AI, PCB, medical testing, Material characterization and advanced materials FDPs and workshops 3.Student development programs Paper publications Research and Patenting Industrial visit with no cost Credit system based courses and value added courses with amount based COE formation in AI, advanced materials, and bio medical stream Job opportunities in Medical devices marketing 14 EXCELR 02.04.2025 EDL – Every Day Online learning for students on new technologies Student online development programs Faculty online development programs Online Internships 15 Oracle Academy 07.10.2024 Software update License and support ×"
}