{
  "url": "https://nsrit.edu.in/computer-science-engineering/cse-projects/",
  "title": "CSE-Projects - NSRIT",
  "content": "Search for: CSE-Projects NSRIT > Computer Science & Engineering > CSE-Projects Department Profile About the Department CSE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Club Extra Curricular Activities Placements Laboratories Program Specific Lab Details Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy CSE-Startups Industrial Intraction Department MOUs CSE Internships Industrial Visits Learning Resources CSE-Materials CSE-Self Reflection Videos CSE-Alumni Department Gallery Contact Us Projects Dr. V. Sreerama Murthy and Dr. Rayudu Srinivas received funding of Rs. 2,00,000.00 (matching grant 1+1) under the AICTE-SPICES scheme, and the project has been successfully completed. Dr. Rayudu Srinivas, Dr. V. Sreerama Murthy, and Mrs. Ch. Devi successfully completed a consultancy project worth Rs. 4,50,000.00 for Demy Software Solutions related to App Development. Dr. D. Sirisha and Dr. V. Ananda Babu have been granted funding of Rs. 96,49,000.00 under the AICTE-IDEA Lab initiative, and the project is currently ongoing. Mr. Jacob Finny Silky and Mr. A. Nagabhushan Rao successfully completed a consultancy project worth Rs. 4,00,000.00 for SCR Agrofarms, Annamai Dt., AP, focused on App Development. Dr. V. Sreerama Murthy and Dr. T.V.S. Sriram have submitted a research proposal worth Rs. 77,51,256.00 to DST under the GeoSpatial Data Science category. Dr. V. Sreerama Murthy and Dr. R. Priya Vaijayanthi have submitted a research proposal amounting to Rs. 60,45,480.00 to SERB-CRG. Dr. D. Sirisha and Mrs. Ch. Devi have submitted a research proposal valued at Rs. 28,79,690.00 to SERB-POWER. Dr. K. Madhavi, Associate Professor, CSE, has submitted a proposal for Rs. 30,00,000.00 under the “SHARE AND MENTOR INSTITUTIONS (MARGDARSHAN)” scheme to AICTE. Dr. K. Madhavi, Associate Professor, CSE, has also submitted a proposal for Rs. 1,00,000.00 under the “SEMINAR GRANT” scheme to AICTE. Dr. T.V.S. Sriram, Associate Professor, CSE, has submitted a proposal for Rs. 45,89,700.00 under the “Modernisation & Removal of Obsolescence (MODROBS)” scheme to AICTE. ×"
}