{
  "url": "https://nsrit.edu.in/computer-science-engineering/faculty-profile/",
  "title": "Faculty Profile - NSRIT",
  "content": "Search for: Faculty Profile NSRIT > Computer Science & Engineering > Faculty Profile Department Profile About the Department CSE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Club Extra Curricular Activities Placements Laboratories Program Specific Lab Details Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy CSE-Startups Industrial Intraction Department MOUs CSE Internships Industrial Visits Learning Resources CSE-Materials CSE-Self Reflection Videos CSE-Alumni Department Gallery Contact Us Department Faculty S. No FACULTY NAME QUALIFICATION DESIGNATION 1 Dr Srinivas Rayudu Ph. D Professor & HOD 2 Dr K. Madhavi Ph. D Professor 3 Dr R. Priya Vaijayanthi Ph. D Professor 4 Dr V. Srirama murthy Ph.D Professor 5 Dr A.S.S.V Ramkumar Ph. D Professor 6 Dr D. Sirisha Ph. D Professor 7 Dr S. Sarojini Devi Ph. D Associate Professor 8 Dr T.V.S Sri Ram Ph.D Associate Professor 9 Dr C.S Manikandan Ph. D Associate Professor 10 Mr K. Shankar M. Tech., (Ph. D) Associate Professor 11 Mrs D. Aparna M. Tech Assistant Professor 12 Mrs S. Krishna Deepika M. Tech Assistant Professor 13 Mrs K. Sudheshna M. Tech.,(Ph.D) Assistant Professor 14 Ms M.S.S Vahini M.Tech.,(Ph.D) Assistant Professor 15 Mr A.Suraj Kumar M. Tech Assistant Professor 16 Mrs M. Bhargavi M.Tech Assistant Professor 17 Mrs .S.Jaya prada M.Tech.,(Ph.D) Sr.Asst.Professor 18 Ms G. Aparanjini M. Tech Assistant Professor 19 Mrs L. T. Priyanka M. Tech Assistant Professor 20 Mrs G Revathi M.Tech.,(Ph.D) Assistant Professor 21 Mrs B.Revathi M. Tech Assistant Professor 22 Mrs A. Anusha M. Tech Assistant Professor 23 Ms B. Geeta Sri M. Tech Assistant Professor 24 Mr Kailash Chandra Nayak M. Tech Assistant Professor 25 Mrs L. Jyothi M. Tech Assistant Professor 26 Mrs T. Anusha M. Tech Assistant Professor 27 Mr Ch. Durga Rao M. Tech Assistant Professor 28 Mr A.Nagabhushan Rao M. Tech Assistant Professor 29 Mr Y. Suresh Gopi M. Tech Assistant Professor 30 Dr.P Vishnu Mahesh Ph.D Adjunct Professor 31 Mrs J. Santoshi Kumari M. Tech.,(Ph.D) Assistant Professor 32 Dr G. Varaprasad M. Tech.,Ph.D Assistant Professor 33 Mr A.M.K Kannababu M. Tech Assistant Professor 34 Mrs Chokkakula Devi M.Tech., (Ph. D) Assistant Professor 35 Mr G. Swamy M. Tech Assistant Professor 36 Mr B. Srinivasa Rao M. Tech Assistant Professor 37 Mr Jacob Finny M. Tech Assistant Professor 38 Mr V.D Ratna Kumar M. Tech Assistant Professor 39 Mrs N. K.Kanaka Mahalakshmi M. Tech Assistant Professor 40 Mr Atchut Vardhan Kalavala M. Tech.,(Ph.D) Assistant Professor 41 Mr Dukka Appalaraju M. Tech.,(Ph.D) Assistant Professor ×"
}