{
  "url": "https://nsrit.edu.in/electrical-electronics-engineering/eee-department-administration/",
  "title": "EEE Department Administration - NSRIT",
  "content": "Search for: EEE Department Administration NSRIT > Electrical & Electronics Engineering > EEE Department Administration Department Profile About the Department EEE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects EEE-Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Clubs Extracurricular Activities Placements Laboratories Program Specific Labs EEE-Industry Supported Laboratories Department Administration Research EEE Publications Projects &Consultancy eee-startups Industrial Interaction Department MOU’s EEE Internships Industrial Visits Learning Resources EEE-Materials EEE-Self Reflection Videos Advanced Learning Alumni Department Gallery Contact Us Department Administration DEPARTMENT RESEARCH COMMITTEE (DRC): Responsibilities: Identify thrust areas and specific topics on which to work further. Identify the faculty who would be working on those areas. Decide if the same can be applied for funding or to request management for funding. Identify funding agencies, forward applications and maintain records. Draw action plan for implementation and monitor the same. The committee shall meet twice in a semester. Committee Members: Dr.R.S.R.KRISHNAM NAIDU, Associate Professor & HOD,Chair person Dr.R.Amaleswari,Associate Professor,Coordinator Dr.S.Rajendra Prasad,Assistant Professor Mr.P.MAHESH, Assistant Professor Mr.K.M.M.TARAKESH, Assistant Professor Mr.K.S.Ramanjaneyulu, Assistant Professor Dr.M.Laxmana Rao , Assoc.Prof Mrs.S.Yamini, Assistant Professor Mr.A.BALA RAJA RAM, ssistant Professor Mrs.M.Swathi, Assistant Professor Mr.K.Naveen, Assistant Professor DEPARTMENT LIBRARY COMMITTEE (DLC): Responsibilities: Prepare a list of books of relevance and also of Journals/magazines with price for getting them to Library. Obtain necessary approval and plan for procurement. Intimate students/staff regarding availability and new arrivals on regular basis. Maintain accession register and issue register. The committee shall meet twice in a semester Committee Members: Dr.R.S.R.KRISHNAM NAIDU, Professor & HOD, Chair person Mrs.S.Chaitanya, Assistant Professor, Coordinator Members Mrs,B,Dharani, Assistant Professor Mr.P.MAHESH, Assistant Professor Mr.K.S.Ramanjaneyulu, Assistant Professor Mr.A.Bala Raja Ram, Assistant Professor Mrs.S.Yamini, Assistant Professor Dr.R.Amaleswari, Associate Professor Mr.K.M.M.TARAKESH, Assistant Professor Mrs.S.Chaitanya, Assistant Professor Dr.M.Laxmana Rao , Assoc.Prof Mrs.M.Swathi, Assistant Professor Mrs.B.Sravani, Assistant Professor BOARD OF STUDIES(BOS) Responsibilities: Monitoring the achievements of Program Outcomes (POs), Program Specific Outcomes (PSOs) and Program Educational Objectives (PEOs), Course Outcomes(COs)  and proposes necessary changes for the attainment of PEOs and POs. Assessment data would be gathered and reported as per assessment cycle. The committee will create an assessment cycle to ensure that all POs, PSOs are being assessed in a reasonable time period. Review submitted assessment plans and reports and recommend revisions as appropriate. Verify that assessment results have been used for programmatic improvements (close the loop). To remain update about current and knowledgeable assessment tools, practices and guidelines. Interact with students, faculty and other stakeholders in facilitating PEOs. Track status and report of work assigned to individual & bring out in notice to DAC. The committee shall meet twice in a semester. Committee Members: Dr. K. Shri Kumar, Professor, University College of Engineering, JNTUGV, Vizianagaram (University Nominee) Dr. P. Malikarajuna Rao, Professor, Andhra University, Visakhapatnam (Academic Council Nominee) Dr. G. Yesuratnam, Professor, Osmania University, Hyderabad (Academic Council Nominee) Mr. B. Srinivas Reddy, GM, RINL, Visakhapatnam (Industry Nominee) Mr. B. Santosh, Junior Manager, Vizag Steel Plant, Visakhapatnam (Alumni), Dr. R.S.R. Krishnam Naidu, Chairman (BoS) CONTENT DELIVERY AND MONITORING COMMITTEE (CDMC) Responsibilities: Monitor course delivery and syllabus completion. Recommend curriculum updates aligning with industry trends and OBE principles. Collect and review course outcomes (COs) mapping and attainment data. Submit quarterly curriculum monitoring reports to IQAC and BoS. Coordinate with examination cell to ensure evaluation aligns with outcomes. Committee Members: Dr.R.S.R.KRISHNAM NAIDU, Professor & HOD, Chair person IQAC Member Class Teachers Two Student Representatives Mr.T.Ramana, Assistant Professor, Coordinator DEPARTMENT BUDGET COMMITTEE (DBC): Responsibilities: Get budget for academic year wise and consolidate for submission to accounts. Monitor use of funds and ensure records are maintained both at the lab and office department. Solicit and scrutinize budget for seminars/guest lectures etc., from the organizing faculty before finalizing and keep a record of the same in department. For any additional unexpected resource requirements, plan for getting approval. Discuss and take action for sanction of any additional resource not envisaged in the budget if need arises. The committee shall meet Monthly once Committee Members: Dr.R.S.R.KRISHNAM NAIDU,Professor & HOD,Chair Mr.A.BALA RAJA RAM, Assistant Professor Dr.S.Rajendra Prasad,Assistant Professor Dr.M.Laxmana Rao ,Assoc.Prof Dr.R.Amaleswari,Associate Professor Mr.K.M.M.TARAKESH,Assistant Professor Mr.P.MAHESH,Assistant Professor Mrs.S.Yamini,Assistant Professor DEPARTMENT PROJECT REVIEW COMMITTEE (DPRC): Responsibilities: Finalize student groups and topics in IV year I Semester. Review and approve the projects Monitor the progress with student groups three times during the duration of project. Approving project submission. Internal evaluation at the end of the project. Identify best projects. Submit copies of project reports to library. Collect titles and synopsis from faculty and ensure entry of these in Project Compendium. Ensure entry of best projects in Project Arcade. The committee shall meet twice in a semester. Committee Members: S.No DEPARTMENT PROJECT REVIEW COMMITTEE (DPRC) POSITION 1 Dr.R.S.R.KRISHNAM NAIDU Associate Professor & HOD Chair 2 Mr.K.M.M.TARAKESH Assistant Professor Coordinator 3 Mr.P.MAHESH Assistant Professor Member 4 Ms.M.SREEDEVI Assistant Professor Member 5 Mr.A.YELLAJI Assistant Professor Member 6 Mrs.V.USHA RANI Assistant Professor Member 7 Mr.A.BALA RAJA RAM Assistant Professor Member PROGRAM ACADEMIC & ASSESSMENT COMMITTEE(PAAC) Responsibilities: Monitor the academic activities of the department to ensure quality teaching, learning, and continuous improvement initiatives are effectively implemented. Engage in continuous quality improvement by proposing timely actions to bridge curriculum gaps. Provide the necessary inputs during the design of the curriculum by module coordinators and faculty. Engage with all stakeholders (students, faculty, industry, employer, alumni,etc.) to gather input and make informed recommendations for improving POs, PSOs. Promote active participation of faculty and students with external communities through the organization or attendance of seminars, workshops, and conferences through head of the department. Encourage the development of projects, working models, and engagement in research to cultivate a culture of lifelong learning and innovation Committee Members: Chairman Dr. R. S. R. Krishnam Naidu, HOD, Chair Person Programme Coordinator Mr. K. M. M. Tarakesh, Assistant Professor Module Coordinators Dr. R. Amaleswari, Associate Professor Mr. P. Mahesh, Assistant Professor Mr. A. Bala Raja Ram, Assistant Professor Mr. K. Naveen, Assistant Professor DEPARTMENT MENTORING COMMITTEE(DMC) Responsibilities: Design and implement a structured mentoring program tailored to the needs of engineering students. Define clear objectives, roles, and responsibilities for mentors and mentees. Assign mentors to students, ensuring an appropriate mentor-to-mentee ratio. Organize training programs to enhance mentors’ skills in counseling, career guidance, and communication. Provide mentors with resources, such as mentoring handbooks and tools, to support their roles effectively Collect and analyze feedback from mentors and mentees to assess program effectiveness. Ensure students receive personalized guidance in academics, career planning, and personal development. Facilitate networking opportunities for students to connect with alumni and industry professionals. Maintain records of mentor-mentee meetings, feedback, and progress reports. Submit periodic reports on the mentoring program’s outcomes to the Head of the Institution Identify gaps and challenges in the mentoring program and propose solutions. Collaborate with department heads, faculty, and administrative staff to align mentoring activities with institutional goals. Committee Members: Dr.R.S.R.KRISHNAM NAIDU, Professor & HOD, Chair person Mr.P.MAHESH, Assistant Professor, Coordinator Mr.K.S.Ramanjaneyulu,Assistant Professor Mr.A.Bala Raja Ram, Assistant Professor Mrs.S.Yamini,Assistant Professor Dr.R.Amaleswari,Associate Professor Mr.K.M.M.TARAKESH, Assistant Professor Dr.M.Laxmana Rao ,Assoc.Prof DEPARTMENT EXAMINATION COMMITTEE(DEC) Responsibilities: All members are requested to strictly follow examination protocols, maintain confidentiality, and ensure timely submission of evaluation reports. Committee Members: Dr.R.S.R.KRISHNAM NAIDU, Professor & HOD, Chair person Coordinator Mr.K.M.M.TARAKESH, Assistant Professor Members Class Teachers Mr.K.S.Ramanjaneyulu, Assistant Professor Mr.A.Bala Raja Ram, Assistant Professor Mrs.S.Yamini,Assistant Professor Dr.R.Amaleswari,Associate Professor Mr.P.Mahesh,Assistant Professor Mrs.S.Chaitanya,Assistant Professor ×"
}