{
  "url": "https://nsrit.edu.in/electronics-communication-engineering/profile/",
  "title": "Profile - NSRIT",
  "content": "Search for: Profile NSRIT > Electronics & Communication Engineering > Profile Department Profile About the Department ECE-Magazines Faculty Faculty List Particpations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Extracurricular Activities Placements Laboratories Program Specific Laboratories ECE-Industry Supported Laboratories Department Administration Research Activities Publications Projects & Consultancy ECE-Startups Industrial Visits Department MoUs ECE Internships ECE-Industrial Visits Learning Resources ECE-Materials ECE-Self Reflection Videos ECE-Alumni Department Gallery Contact Us Department Faculty S.No FACULTY NAME QUALIFICATION DESIGNATION 1 Dr B.Siva Prasad M.Tech, Ph. D Professor & HOD 2 Dr N.N.S.V. Rama Raju M.Tech, Ph. D Professor 3 Dr K.Parvathi M.Tech, Ph. D Professor 4 Dr S. Sridhar M.Tech, Ph. D Professor 5 Dr B.Ravichandra M.Tech, Ph. D Associate Professor 6 Dr K.Rajasekhar M.Tech, Ph. D Associate Professor 7 Dr.V. Swetha M.Tech, Ph. D Associate Professor 8 Dr P. Hema Kumar M. Tech, Ph.D Associate Professor 9 Dr K. Chandra Sheker M.Tech, Ph. D Associate Professor 10 Dr N. Kurumurthy M. Tech, Ph. D Associate Professor 11 Mr S. Balarama Murthy M.E, (Ph.D) Associate Professor 12 Mrs M.V.S. Roja Ramani M.Tech, (Ph. D) Assistant Professor 13 Mr G.Durga Prasad M. Tech Assistant Professor 14 Mrs.Y.H.D.Aparna M.Tech,(Ph.D) Assistant Professor 15 Mrs.A.Gowthami Naidu M.Tech Assistant Professor 16 Mr.S.V.Ramanaji Kalla M.Tech Assistant Professor 17 Mrs. K. Priyanka M.Tech Assistant Professor 18 Mrs. P.Anitha M.Tech Assistant Professor 19 Mrs. CH. Harini M.Tech Assistant Professor 20 Mrs B.N.S.Rani M.Tech, (Ph. D) Assistant Professor 21 Mrs K.V.E.Sarojini M.Tech Assistant Professor 22 Mrs U.Sadhana M. Tech Assistant Professor 23 Mrs M. Padma Priyanka . Tech Assistant Professor 24 Mrs A. Phani Madhuri M.Tech, (Ph. D) Assisstant Professor 25 Ms.B.Sowjanya M.Tech Assistant Professor 26 Mrs G. Soundarya M.Tech,(Ph.D) Assistant Professor 27 Mrs A.Asha M. Tech Professor 28 Mrs D. Prasanna Kumari M. Tech Assistant Professor 29 Mrs G. Lakshmi Sunitha M. Tech Assistant Professor 30 Mr M. Chandrakanth M. Tech Assistant Professor 31 Mrs R. Lavanya M. Tech Assistant Professor 32 Mr G. Vijay Kumar M. Tech Assistant Professor 33 Mr N. Balanarsimha M. Tech Assistant Professor 34 Mr B. Radha Krishna M. Tech Assistant Professor 35 Mr. Shaik Nagul Meera M. Tech Assistant Professor 36 Mr P. Naresh M. Tech Assistant Professor 37 Mrs V. Kavitha M. Tech Assistant Professor 38 Mr M.V.S. Akhil M. Tech Assistant Professor 39 Mr V. Ravi Tejesvi M. Tech Assistant Professor 40 Ms G.Aswani M. Tech Assistant Professor 41 Dr A. Vamsee Krishna M. Tech, Ph. D Adjunct Faculty 42 Mr. Dinesh Kumar Hirawat M.S Adjunct Faculty ×"
}