{
  "url": "https://nsrit.edu.in/electronics-communication-engineering/ece-projects/",
  "title": "ECE-Projects - NSRIT",
  "content": "Search for: ECE-Projects NSRIT > Electronics & Communication Engineering > ECE-Projects Department Profile About the Department ECE-Magazines Faculty Faculty List Particpations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Extracurricular Activities Placements Laboratories Program Specific Laboratories ECE-Industry Supported Laboratories Department Administration Research Activities Publications Projects & Consultancy ECE-Startups Industrial Visits Department MoUs ECE Internships ECE-Industrial Visits Learning Resources ECE-Materials ECE-Self Reflection Videos ECE-Alumni Department Gallery Contact Us Projects & Consultancy Mr.S.Balarama Murty and Dr.K.Rajasekhar have submitted a  proposal  to AICTE ATAL Academy for a funding of Rs.1,00,000 towards online 6-day FDP on the topic of “ Recent trends in VLSI design flow” Dr.Virender Singh,Dr.R.Amaleswari and Dr.B.Siva Prasad have submitted a research proposal to DST under the SERB-CRG scheme valued at Rs.55,55,263 on the topic of “Development and Analysis of the MEMS based piezoelectric energy harvester sensor array by utilizing ambient physical vibrations.” Dr.B.Siva Prasad and Dr.K.Ravi Kumar have submitted a research proposal to DST under the SERB-CRG scheme valued at Rs.34,32,264 on the topic of “Design and implementation of Deep Convolutional Neural Networks for improving resolution in Ground – Penetrating Radar images”. Dr.R.Amaleswari and Dr.Virender Singh have submitted a research proposal to DST under the SERB-CRG scheme valued at Rs.31,85,600 on the topic of “Solar based High Gain Multi-Input DC-DC Coverter for DC Microgrid”. Dr.R.Amaleswari and Dr.Virender Singh have submitted a research proposal to DST under the SERB-POWER GRANT scheme valued at Rs.29,04,440 on the topic of “Renewable energy Based High Gain Converter for Electric Vehicle”. ×"
}