{
  "url": "https://nsrit.edu.in/electronics-communication-engineering/ece-department-administration/",
  "title": "ECE-Department Administration - NSRIT",
  "content": "Search for: ECE-Department Administration NSRIT > Electronics & Communication Engineering > ECE-Department Administration Department Profile About the Department ECE-Magazines Faculty Faculty List Particpations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Extracurricular Activities Placements Laboratories Program Specific Laboratories ECE-Industry Supported Laboratories Department Administration Research Activities Publications Projects & Consultancy ECE-Startups Industrial Visits Department MoUs ECE Internships ECE-Industrial Visits Learning Resources ECE-Materials ECE-Self Reflection Videos ECE-Alumni Department Gallery Contact Us Department Administration DEPARTMENT PROJECT REVIEW COMMITTEE (DPRC) Responsibilities: Finalize student groups and topics in IV year I Semester. Review and approve the projects Monitor the progress with student groups three times during the duration of project. Approving project submission. Internal evaluation at the end of the project. Identify best projects. Submit copies of project reports to library. Collect titles and synopsis from faculty and ensure entry of these in Project Compendium. Ensure entry of best projects in Project Arcade. The committee shall meet twice in a semester. Committee Members Dr. B. Siva Prasad, Professor, HOD, Chair person Dr. K. Parvathi, Professor Dr. K. Rajasekhar, Associate Professor Dr. N. Kurumurthy, Associate Professor Mr.G.Durga Prasad, Assistant Professor Ms.B.Sowjanya, Assistant Professor DEPARTMENT BUDGET COMMITTEE (DBC) Responsibilities: Get budget for academic year wise and consolidate for submission to accounts. Monitor use of funds and ensure records are maintained both at the lab and office department. Solicit and scrutinize budget for seminars/guest lectures etc., from the organizing faculty before finalizing and keep a record of the same in department. For any additional unexpected resource requirements, plan for getting approval. Discuss and take action for sanction of any additional resource not envisaged in the budget if need arises. The committee shall meet Monthly once. Committee Members Dr.  B. Siva Prasad, Professor, HOD, Chair person Mrs.A.Phani Madhuri, Assistant Professor Mrs.B.N.S.Rani, Assistant Professor Mr.S.Venkatesh,Technician DEPARTMENT LIBRARY COMMITTEE (DLC) Responsibilities: Prepare a list of books of relevance and also of Journals/magazines with price for getting them to Library. Obtain necessary approval and plan for procurement. Intimate students/staff regarding availability and new arrivals on regular basis. Maintain accession register and issue register. The committee shall meet twice in a semester. Committee Members 1) Dr. B. Siva Prasad, Professor, HOD, Chair person 2) Mrs.Y.H.D.Aparna, Assistant Professor 3) Mrs. G.Lakshmi Sunitha, Assistant Professor 4) Mrs.R. Lavanya, Assistant Professor 5) Mrs.Ch.Harini, Assistant Professor 6) Mr. B. Radha Krishna, Assistant Professor 7) Mr.S.V.Ramanaji Kalla, Assistant Professor DEPARTMENT ADVISORY BOARD(DAB) Responsibilities: Periodically evaluate the attainment of POs and PSOs, identifying areas for improvement. Assess the effectiveness of the program and recommend necessary improvements to ensure continuous quality enhancement. Identify and propose actions to address curriculum gaps, ensuring the effective achievement of POs and PSOs. Interact with the stakeholders through HoD to facilitate the achievement of POs, PSOs and PEOs. Committee Members Chairman : Dr .B .Siva Prasad ,Professor, HOD, Chair person Members : Programme Coordinator: Dr.N.N.S.V Rama Raju, Professor Module Coordinators : Dr. K. Rajasekhar, Associate professor Dr. B. Ravi Chandra, Associate professor Dr V. Swetha,Associate Professor Mrs. M.V.S. Roja Ramani, Assistant Professor Faculty Representatives: Mr. G.Durga Prasad, Assistant Professor Mrs.B.N.S.Rani, Assistant Professor Industry Representation: Mr. Dinesh Hirawat ,HMI Engineering services Academician: Dr .G. V. Sridhar,Professor ,ECE, Raghu Engineering College, Dhakamarri Alumni Representation: Ms. K. Sravani, TCS, Chennai Mr. K. Bharat, Tilicho Labs, Visakhapatnam Parents: Sri. L. Kanaka Raju Sri. A. Govinda Rao Students: Ms. L. Swarnanjali (21NU1A0468) Mr. A. Guruteja (21NU1A0405) CURRICULAM DELIVERY MONITORING COMMITTEE (CDMC) Responsibilities: Monitor course delivery and syllabus completion. Recommend curriculum updates aligning with industry trends and OBE principles. Collect and review course outcomes (COs) mapping and attainment data. Submit quarterly curriculum monitoring reports to IQAC and BoS. Coordinate with examination cell to ensure evaluation aligns with outcomes. Committee Members Dr.  B. Siva Prasad, Professor, HOD, Chair person IQAC Member Class Teacher Two Student Representatives DEPARTMENT RESEARCH COMMITTEE(DRC) Responsibilities: Identify thrust areas and specific topics on which to work further. Identify the faculty who would be working on those areas. Decide if the same can be applied for funding or to request management for funding. Identify funding agencies, forward applications and maintain records. Draw action plan for implementation and monitor the same. The committee shall meet twice in a semester. Committee Members Dr. B. Siva Prasad, Professor, HOD, Chair person Dr. N.N.S.V.Rama Raju, Professor Dr. P. Hema Kumar, Associate Professor Dr. V.Swetha, Associate Professor Mr. Shaik Nagul Meera, Assistant Professor Mrs. G. Soundarya, Assistant Professor BOARD OF STUDIES(BOS) Responsibilities: Monitoring the achievements of Program Outcomes (POs), Program Specific Outcomes (PSOs) and Program Educational Objectives (PEOs), Course Outcomes(COs)  and proposes necessary changes for the attainment of PEOs and POs. Assessment data would be gathered and reported as per assessment cycle. The committee will create an assessment cycle to ensure that all POs, PSOs are being assessed in a reasonable time period. Review submitted assessment plans and reports and recommend revisions as appropriate. Verify that assessment results have been used for programmatic improvements (close the loop). To remain update about current and knowledgeable assessment tools, practices and guidelines. Interact with students, faculty and other stakeholders in facilitating PEOs. Track status and report of work assigned to individual & bring out in notice to DAC. The committee shall meet twice in a semester. Committee Members 1) Dr. B. Siva Prasad, Professor, HOD, Chair person 2) Dr. K. Chandra Bushana Rao Professor, Dept. of ECE, JNTUGV, Vizianagaram, Member (JNTUGV Nominee) 3) Dr. T.Kishore Kumar , Professor, Dept. of ECE, NIT Warangal, Member (Academician) 4) Dr. P. Rajesh Kumar, Professor & Head, Dept. of ECE, Andhra University, Member(Academician) 5) Mr. Ravi Kumar Siadri, Senior Firmware Engineer, Microsoft India R&D, Hyderabad,Member (Industry Expert) 6)Mr. Ajay Kumar Nandam, Senior Software Engineer, AMD Hyderabad, Member (Alumni) DEPARTMENT EXAMINATION COMMITTEE(DEC) Responsibilities: All members are requested to strictly follow examination protocols, maintain confidentiality, and ensure timely submission of evaluation reports. Committee Members Dr.  B. Siva Prasad, Professor, HOD, Chair person Mr.G.Durga Prasad, Assistant Professor Mrs. M.Padma Priyanka, Assistant Professor Mrs.K.Priyanka, Assistant Professor DEPARTMENT MENTORING COMMITTEE Responsibilities Design and implement a structured mentoring program tailored to the needs of engineering students. Define clear objectives, roles, and responsibilities for mentors and mentees. Assign mentors to students, ensuring an appropriate mentor-to-mentee ratio. Organize training programs to enhance mentors’ skills in counseling, career guidance, and communication. Provide mentors with resources, such as mentoring handbooks and tools, to support their roles effectively Collect and analyze feedback from mentors and mentees to assess program effectiveness. Ensure students receive personalized guidance in academics, career planning, and personal development. Facilitate networking opportunities for students to connect with alumni and industry professionals. Maintain records of mentor-mentee meetings, feedback, and progress reports. Submit periodic reports on the mentoring program’s outcomes to the Head of the Institution Identify gaps and challenges in the mentoring program and propose solutions. Collaborate with department heads, faculty, and administrative staff to align mentoring activities with institutional goals. Committee Members Dr.  B. Siva Prasad, Professor, HOD, Chair person Dr. B.Ravi Chandra, Associate Professor Dr.K.Rajasekhar, Associate professor Mrs .M.V.S.Roja Ramani, Assistant Professor Mrs.Y.H.D.Aparna, Assistant Professor PROGRAM ACADEMIC & ASSESSMENT COMMITTEE(PAAC) Monitor the academic activities of the department to ensure quality teaching, learning, and continuous improvement initiatives are effectively implemented. Engage in continuous quality improvement by proposing timely actions to bridge curriculum gaps. Provide the necessary inputs during the design of the curriculum by module coordinators and faculty. Engage with all stakeholders (students, faculty, industry, employer, alumni,etc.) to gather input and make informed recommendations for improving POs, PSOs. Promote active participation of faculty and students with external communities through the organization or attendance of seminars, workshops, and conferences through head of the department. Encourage the development of projects, working models, and engagement in research to cultivate a culture of lifelong learning and innovation Committee Members: Chairman: Dr.  B. Siva Prasad, Professor, HOD, Chair person Programme Coordinator: Dr.  N.N.S.V.Rama Raju, Professor Members & Module Coordinators: Dr.K.Rajasekhar, Associate professor Dr.V.Swetha, Associate professor Dr. B.Ravi Chandra, Associate Professor Mrs .M.V.S.Roja Ramani, Assistant Professor ×"
}