{
  "url": "https://nsrit.edu.in/electrical-electronics-engineering/eee-faculty/",
  "title": "EEE Faculty - NSRIT",
  "content": "Search for: EEE Faculty NSRIT > Electrical & Electronics Engineering > EEE Faculty Department Profile About the Department EEE-Magazines Faculty Faculty List Faculty Participations & Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects EEE-Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Technical Clubs Extracurricular Activities Placements Laboratories Program Specific Labs EEE-Industry Supported Laboratories Department Administration Research EEE Publications Projects &Consultancy eee-startups Industrial Interaction Department MOU’s EEE Internships Industrial Visits Learning Resources EEE-Materials EEE-Self Reflection Videos Advanced Learning Alumni Department Gallery Contact Us The Department of Electrical and Electronics Engineering was formed in the year 2008. The department has started various programmeswith an initial intake of B.Tech 60 in the year 2008,Diploma 60 in the year 2012,M.Tech(Power Systems Control and Automation) 24in the year 2014. The department has qualified teaching staff with 2 Ph.Ds and 9 M.Tech’s. The faculty members are involved in research activities and published/presented papers in national and international journals and conferences. The department of Electrical and Electronics Engineering encompasses many technologies such as power systems, electrical machines, control systems, electromagnetic theory, and computer methods employed in all these areas, which have been among the fastest growing and most challenging technologies that enable the development of the modern society. The department conducts various programs under the departmental association called as ADVAYA such as Workshops, Technical Training, Guest Lectures and Seminar by Experts from Industry and Academic background for constant knowledge up-gradation of staff and students. We continue to play a leading role in our discipline which leads us towards creating innovative and effective professional graduate community which would vivacious and provide continuous learning. The growth and progress of Medium and large scale Industries depend upon the expertise provided by the Specialists. With rapid Industrial growth in the Country the requirement of electrical engineers has tremendously increased in Power Sector and Industries in private, PSUs and Government companies. It resulted in opening of enormous opportunities for graduate Electrical Engineers. Vision To be a hub for imparting knowledge, skills and behavior for exemplary contributions in the field of Electrical & Electronics Engineering Mission To impart technical education through the state of  the art infrastructural facilities, laboratories and instruction To inculcate industry oriented learning through industrial visits, internships, projects at industries, MOUs, to make students technically skilled oriented Creating conducive environment for higher education , employment and entrepreneurship through quality education ,professional skills and research To promote societal commitment among students by inculcating moral and ethical values Program Educational Objectives (PEOs) PEO1: Demonstrate the real-world engineering problem solving skills by applying the fundamental and conceptual engineering knowledge as a practicing Electrical and Electronics engineer or as a member/lead in a multidisciplinary project setting that utilize 21st century skills PEO2: Provide research-based engineering solutions addressing the triple bottom line of environment and sustainability maintaining the professional standards, ethics and integrity PEO3: Foster self-directed learning through their professional experience, technology advancements in their relevant field of interest and desiring graduates pursue advanced higher education leading to research Program Outcomes (POs) The POs are the transactional statements of graduate attributes (GAs) that each graduating engineer should possess in terms of knowledge, skill and behavior with a minimum target performance level at the time of graduation as fixed by the program of study seeking continuous improvement year on year. The graduates of Electrical & Electronics Engineering of NSRIT will be able to demonstrate the following outcomes in terms knowledge, skill and behavioral competencies at the time of graduation with the expected target performance level Apply the knowledge of basic sciences and fundamental engineering concepts in solving engineering problems (Engineering Knowledge) Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences. (Problem Analysis) Design solutions for complex engineering problems and design system components or processes that meet the specified needs with appropriate consideration for the public health and safety, and the cultural, societal, and environmental considerations (Design/Development of Solutions) Perform investigations, design and conduct experiments, analyse and interpret the results to provide valid conclusions (Investigation of Complex Problems) Select/develop and apply appropriate techniques and IT tools for the design & analysis of the systems (Modern Tool Usage) Give reasoning and assess societal, health, legal and cultural issues with competency in professional engineering practices (The Engineer and Society) Demonstrate professional skills and contextual reasoning to assess environmental/societal issues for sustainable development (The Environment and Sustainability) Demonstrate Knowledge of professional and ethical practices (Ethics) Function effectively as an individual, and as a member or leader in diverse teams, and in multi-disciplinary situations (Individual and Team Work) Communicate effectively among engineering community, being able to comprehend and write effectively reports, presentation and give / receive clears instructions (Communication) Demonstrate and apply engineering & management principles in their own / team projects in multidisciplinary environment (Project Finance and Management) Recognize the need for, and have the ability to engage in independent and lifelong learning (Life Long Learning) Program Specific Outcomes (PSOs) PSO1: To analyze and design electrical systems and components for various applications in the field of electrical vehicles renewable energy systems and drives. PSO2:  To expose the student to the contemporary hardware and software tools of electrical and electronics systems for solving complex problems in the field of power electronics and associated areas. ×"
}