{
  "url": "https://nsrit.edu.in/history/",
  "title": "History - NSRIT",
  "content": "Search for: History NSRIT > History Home Recruitment About Us History Vision-Mission-Quality Policy Institutional Policies Strategic Plan Strategic Priorities Stakeholder-engagment-framework Institutional Performance Indicators President’s Message Founders Why NSRIT Leadership Principal’s Message CMo’s Message RTI Information Campus Life Clubs Facilities Computer Center Library Seminar Hall Transport Cafteria & Hostel Talent Incubation Center Makers Space Design Space Recording Studio Other Facilities Sports NSS & YRC Newsletter Administration Organizational Chart Governing Body Academic Council Finance Committee Institutional Committee(s) Audited Statements AICTE Approvals AICTE-EOA(2025-26) Admissions Admissions 2025 – 2026 Courses Offered Fee Structures Admission policy and process Details Circulars Autonomous Outcome Based Education Academic Regulations Curriculum & Syllabi Pedagogy and Learning Methodologies Academic calendar Controller of Examination ABC Policy Document Institutions Under ABC SOP (ABC) -NSRIT ABC Grievance Redressal Cell List of Courses (Under ABC) ABC Awareness Videos Video – 1 Video – 2 Video – 3 Video – 4 Academics Civil Engineering Mechanical Engineering Electrical & Electronics Engineering Electronics & Communication Engineering Computer Science & Engineering Computer Science & Engineering (AI & ML) Computer Science & Engineering (DS) S & H MBA MCA Faculty Faculty Professional Development Certifications Student Certifications Professional Certifications Accreditation & Ranking IQAC Annual quality assurance reports Campus land and buildings Barrier free and indusive access Environmental sustainability Centre of excellence NAAC Certificate NBA Accreditation Orders QS I-GAUGE NIRF NIRF-Overall Ranking NIRF-Engineering NIRF-Management NIRF-Innovation IIC Entrepreneurship and startup support Patents-Innovations-Startups Intellectual property and innovation cell IIE Academic Partnership Industry integrated courses Internship opportunities R&D Profile Core Team Research Infrastructure Projects Research Areas Consultancy Services Contact Us Quick Links Website Navigation AICTE IDEA LAB Placements Objective Placement Policy Placement Summary Placement Brochure Trainers Placement Gallery Contact T & P Pay Fees Youtube Channel Student Alumini HISTORY Nadimpalli Satyanarayana Raju Institute of Technology (Formerly Known as VITS College of Engineering) was established in the year 2008 by Sree Veera Venkata Satyanarayana Educational Society. NSRIT offers quality education and technical competencies on the strong foundation of values, ideals and rich culture to the students across the country and beyond. NSRIT attempts to integrate classroom learning with industry exposure to ensure the application of knowledge during the course of study it self. The objective is to prepare young students to act as leaders for the promotion of the economic and industrial growth of the country and to play a creative role in society. We focus on imparting skills on cutting – edge technologies to our students. Quality research in the areas of science and technology is given considerable importance here. Our major strength comes by forging strong industry – academic linkage. The institute celebrates freedom of taught, cultivates vision and encourages growth and also inculcates human values and concern for the environment and society. ×"
}