{
  "url": "https://nsrit.edu.in/",
  "title": "Home - NSRIT",
  "content": "Search for: Faculty Login Student Login NSRIT Dashboard Web Mail Results NEWS NSRIT Insights Nadimpalli Satyanarayana Raju Institute of Technology (Formerly Known as VITS College of Engineering) was established in the year 2008 by Sree Veera Venkata Satyanarayana Educational Society. NSRIT offers quality education and technical competencies on the strong foundation of values, ideals and rich culture to the students across the country and beyond. NSRIT attempts to integrate classroom learning with industry exposure to ensure the application of knowledge during the course of study it self. The objective is to prepare young students to act as leaders for the promotion of the economic and industrial growth of the country and to play a creative role in society. GRIEVANCE CELL Institutional Committee(s) Grievance Redressal Committee (SOP) NSRIT Mandatory Disclosure Admissions Referral Forms NSRIT Service Rules What's Happening in NSRIT B.Tech II Semester(Autonomous)-2024 Admitted Batch Mid-I Examinations Scheduled from 10.03.2025 B.Tech VIII Semester(Autonomous)-2021 Admitted Batch Mid-II Examinations Scheduled from 19.03.2025 Exam Cell B.Tech II Semester(Autonomous)-2024 Admitted Batch Mid-I Examinations Scheduled from 10.03.2025 B.Tech VIII Semester(Autonomous)-2021 Admitted Batch Mid-II Examinations Scheduled from 19.03.2025 Recruiters Students\nAchievements G.SARATH CHANDRA, Roll NO: 14NU1A0311, 88.41 % Congratulates the University Gold Medalist\nG.Sarath Chandra, Roll No: 14NU1A0311, Preclinical Engineering Batch - 2014 -18 G. PUSHPA LATHA, 12NU1A0414, 2012-16 Batch Padmabushan Dr.B.V Raju Memorial Gold Medal Award of Merit Padmabushan Dr.B.V Raju Memorial Gold Medal Award of Merit Padmabushan Dr.B.V Raju Memorial Gold Medal Award of Merit Faculty\nAchievements Hearty Congratulations.. Congratulations to Dr P. Naga Eswara Naveen, Department of Mechanical, Awarded  Ph.D from  GITAM University, Visakhapatnam . Hearty Congratulations.. Congratulations to Dr. E.Madhavi,M.Sc., Ph.D, Department of S&H, awarded Ph.D Degree  from Andhra University, Visakhapatnam. Photo Galley Press Galley Our Associations ×"
}