{
  "url": "https://nsrit.edu.in/mechanical-engineering/",
  "title": "Mechanical Engineering - NSRIT",
  "content": "Department Profile About the Department Mech-Magazines Faculty Profile Faculty Achievements Student’s Corner Roll of Honour Academic Toppers Academic Projects ME-Skill Oriented Courses Professional Societies – Activities Co-Curricular Activities Placements Laboratories Program Specific Laboratories ME-Industry Supported Laboratories Department Administration Research Publications Projects & Consultancy ME-Startups Industrial Intraction Department MOU’S ME Internships Industrial Visits Learning Resources ME-Materials ME-Self Reflection Videos ME-Alumni Department Gallery Contact Us About the Department The Department of Mechanical Engineering is established in the year 2009 with an intake of 60. The Department is offering a post graduate program in Thermal Engineering with an intake of 12 from the year 2014.The Department has facilities in terms of faculty, infrastructure and equipment. The Department consists of 3-Professors,2-Associate Professors,15-Assistant Professors. Overall 6 faculty completed Ph. D and 6 faculty members registered for Ph.D. The B. Tech program is accredited by National Board of Accreditation (NBA) under TIER -II in 2022. Mr. G. Sarath Chandra, B. Tech graduate in 2018, was awarded the gold medal among all affiliated colleges under JNTUK based on his academic performance. The department strives to bridge the gap between Industry and Academics, Applied Robotic Control (ARC) lab was initiated in collaboration with APSSDC & APS GMBH ECM, Aachen, Germany for providing real time Industrial training to the students. The Vision To train the students to become professional Mechanical Engineers to take up the challenges in the society and strive continuously to excel in the field of mechanical engineering The Mission To provide quality education to excel in the profession through innovative teaching learning process To emphasize experiential learning that equips the students to address the challenges in the society To foster a culture of research and innovation to solve real world engineering problems PROGRAM  EDUCATIONAL OBJECTIVE (PEOs) The PEOs are the educational goals that reflect Professional and Career Accomplishments that a graduate hould attain after 4 – 5 years of his/her graduation. The graduates of Mechanical Engineering of NSRIT will PEO #1: Continue to excel in the professional career towards 21 st century skills, ethical practices and sustainable solutions to address the real-world engineering problems PEO #2: Engage in experiential learning through their professional practices and adapt to changing skill sets in the pursuit of lifelong learning PEO #3: Continue to demonstrate the skill sets that are very much essential to work successfully for a rewarding career in a multidisciplinary scenario. PROGRAM OUTCOMES(POs) The POs are the transactional statements of graduate attributes (GAs) that each graduating engineer should possess in terms of knowledge, skill and behavior with  a  minimum target performance level at  the time of graduation as fixed by the program of study seeking continuous improvement year on year. The graduates of Mechanical Engineering of NSRIT will be able to demonstrate the following outcomes   in terms knowledge, skill, and behavioral competencies at the time of graduation with  the  expected  target performance level. Apply the knowledge of basic sciences and fundamental engineering concepts in solving engineering problems (Engineering Knowledge) Identify, formulate, review research literature, and analyze complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences, and engineering sciences (Problem Analysis) Design solutions for complex engineering problems and design system components or  processes that meet the specified needs with appropriate consideration for  the  public health  and safety, and the cultural, societal, and  environmental considerations  (Design/Development  of Solutions) Perform investigations, design and conduct experiments, analyse and interpret the results to provide valid conclusions (Investigation of Complex Problems) Select/develop and apply appropriate techniques and IT tools for the design & analysis of the systems (Modern Tool Usage) Give reasoning and assess societal, health, legal and cultural issues with competency in professional engineering practices (The Engineer and Society) Demonstrate professional skills and contextual reasoning to assess environmental/societal  issues for sustainable development (The Environment and Sustainability) Demonstrate Knowledge of professional and ethical practices (Ethics) Function effectively as an individual, and as a member or leader in diverse teams, and in multi- disciplinary situations (Individual and Team Work) Communicate effectively among engineering community, being able to comprehend and write effectively reports, presentation and give / receive clears instructions (Communication) Demonstrate and apply engineering & management principles in their own / team projects in multidisciplinary environment (Project Finance and Management) Recognize the need for, and have the ability to engage in independent and lifelong learning (Life Long Learning) PROGRAMME SPECIFIC OUTCOMES (PSOs) Demonstrate adequate core competency in designing and fabricating mechanical systems, thermal and hydraulic machines, materials and similar others, and  thereby  providing sustainable computer aided solutions maintaining professional standards and value system Demonstrate adequate knowledge in the allied specialization of Mechanical Engineering that adds value addition for professional practices"
}