{
  "url": "https://nsrit.edu.in/rd/",
  "title": "R&D - NSRIT",
  "content": "Search for: R&D NSRIT > R&D Policy Document Institutions Under ABC SOP (ABC) -NSRIT ABC Grievance Redressal Cell List of Courses (Under ABC) ABC Awareness Videos Video – 1 Video – 2 Video – 3 Video – 4 The Department of Master of Business Administration ( MBA) was formed in the year 2009. The department has started Masters programme with an initial intake of 60 in the year 2009 and 120 from 2010 onwards. The MBA department has qualified teaching staff with 2 professors and 11 Assistant professors with MBA,M.Com degrees . The faculty members are involved in research activities and published/presented papers in national and international journals and conferences. The department has progressed with a vision and a strong commitment in making young and dynamic mangers , entrepreneurs for the society to lead the competitive world. The department provide class room teaching , training, and practical knowledge in all the aspects of business and Managerial level . Most of the MNCs are looking for a skilled and qualified management professionals for their companies to fill the gaps of the industry with the knowledgeable people. Students can also pursue higher education in specialized courses like Software Engineering, Artificial Intelligence, and Networking etc. Vision: Create centre of excellence in the field of Management Education to groom the talent to the expectations of stakeholders. Mission: Our Mission is to train our students develop higher order thinking skills, leadership abilities, equality and unity by using a combination of the core knowledge curriculum and good entrepreneurship  qualities. PROFILE NSRIT started the MBA programme in 2009. The Department is one of the prestigious wings of the college. It conducts a Four-semester full-time MBA programme, affiliated to the Jawaharlal Nehru Technological University, Kakinada and approved by the AICTE. The Business Administration Programme at NSRIT is designed to equip practicing managers to act as agents of change-catalysts in effective decision making. It is a matter of our conviction to make this a premier education institution, contributing towards the expansion of knowledge base in the field of management science through research, innovation in management theory and practice and new initiatives. Objectives of the Programme: The objective of the programme is to provide a world – class quality professional education in management. More specific objectives are: i. to understand and expose the students to social, economic, political, technological and ecological    environment of modern society and their characteristic values. ii. to mould the students to become effective global managers in the competitive environment. iii. to develop a portfolio of versatile skills to become effective leaders in the fast changing global business     environment. iv. to provide challenging career in the world of work v. to inculcate entrepreneurial skills for creating and managing their own enterprise. vi. to mould students into socially responsible citizen. SHORT TERM GOALS * To enhance the self-learning skills among the students. * To design the curriculum and modes of teaching in a way that it helps students to use their expertise to tackle complex real-world challenges * To adopt innovative methods and practices in imparting quality management education. * To encourage and prepare students to attend intercollegiate, regional, national, and international events (competitions, conferences, boot camps, etc.) on entrepreneurship * To train students in communication, oral and written LONG TERM GOALS : •To transform students into leaders and entrepreneurs •To associate with corporate companies and top business schools for greater industrial     exposure •To focus on relationship building with stakeholders in a win-win situations. •To undertake research and consultancy services in the long run to serve the needs of the region and beyond. •To be a responsible citizen in promoting professional values of management. ×"
}