{
  "url": "https://nsrit.edu.in/s-h/s-h-department-administration/",
  "title": "S & H Department Administration - NSRIT",
  "content": "Search for: S & H Department Administration NSRIT > S & H > S & H Department Administration Dept Profile Faculty List Faculty Participations & Achievements Student’s Corner Academic Toppers Professional Societies – Activities SH-Skill Oriented Courses Co-Curricular Activities Extracurricular Activities S & H Laboratories Department Administration Research Activities Publications Learning Resources SH-Materials SH-Self Reflection Videos Department Gallery Contact Us Department Administration DEPARTMENT RESEARCH COMMITTEE (DRC): Responsibilities Identify thrust areas and specific topics on which to work further. Identify the faculty who would be working on those areas. Decide if the same can be applied for funding or to request management for funding. Identify funding agencies, forward applications and maintain records. Draw action plan for implementation and monitor the same. Committee members Dr. V Krishna, Professor, HOD, Chairperson Dr. NVSS Suryanarayana, Professor Dr. U V Subbarao, Professor Dr. KSDL Kalyan Prasad, Associate Professor Dr. V Seetharama Raju, Associate Professor Dr. M A Rahamatulla, Associate Professor Dr. E Madhavi, Assistant Professor Dr. Y Kusuma Kumari, Assistant Professor Dr. N Guna Devi, Assistant Professor BOARD OF STUDIES (BOS) Responsibilities Monitoring the achievements of Program Outcomes (POs), Program Specific Outcomes (PSOs) and Program Educational Objectives (PEOs), Course Outcomes(COs)  and proposes necessary changes for the attainment of PEOs and POs. Assessment data would be gathered and reported as per assessment cycle. The committee will create an assessment cycle to ensure that all POs, PSOs are being assessed in a reasonable time period. Review submitted assessment plans and reports and recommend revisions as appropriate. Verify that assessment results have been used for programmatic improvements (close the loop). To remain update about current and knowledgeable assessment tools, practices and guidelines. Interact with students, faculty and other stakeholders in facilitating PEOs. Track status and report of work assigned to individual & bring out in notice to DAC. The committee shall meet twice in a semester. Committee Members Dr. V Krishna, HOD, Chairperson Dr. NVVS Suryanarayana, Professor Dr. U V Subbarao, Professor Dr. KSDL Kalyan Prasad, Associate Professor Dr. M Prasanthi, Associate Professor DEPARTMENT BUDGET COMMITTEE(DBC): Responsibilities Get budget for academic year wise  and consolidate for submission to accounts. Monitor use of funds and ensure records are maintained both at the lab and office department. Solicit and scrutinize budget for seminars/guest lectures etc., from the organizing faculty before finalizing and keep a record of the same in department. For any additional unexpected resource requirements, plan for getting approval. Discuss and take action for sanction of any additional resource not envisaged in the budget if need arises. Committee Members Dr. V Krishna, Professor, HOD, Chairperson Dr. KSDL Kalyan Prasad, Associate Professor Dr. U V Subbarao, Professor Mrs. NVS Pallavi, Assistant Professor Mr. Ch Dilleswara Rao, Physical Director Mrs. V K Mahalakshmi, Assistant Professor DEPARTMENT EXAMINATION COMMITTEE (DEC) Responsibilities All members are requested to strictly follow examination protocols, maintain confidentiality, and ensure timely submission of evaluation reports. Committee members: Dr. V Krishna, Professor, HOD, Chairperson Dr. E Madhavi, Assistant Professor Mrs. R D Jyothsna, Assistant Professor Ms. V Aishwarya Sree, Assistant Professor DEPARTMENT ADVISORY BOARD (DAB): Responsibilities Suggest improvement in academic plans and recommend standard practices/systems for attainment of PO’s & Encourage for industry-institute interactions to bridge up curriculum/industry gap and suggest quality improvement initiatives to enhance employability. To propose necessary action plan for skill development of students, required for entrepreneurship development and quality improvement. To identify and suggest thrust areas to conduct various activities Bringing industry standards in academic in order to bridge gap between industry and academics. Improving department by its structure and its academics by understanding the current and former students need by their parents and alumni respectively and Departmental queries which expects advice to consider enhancing the departmental business process. Committee Members Dr. V Krishna, Professor, HOD, Chairperson Mr. P Paripurna chari, Assistant Professor Dr. M A Rahamatulla, Associate Professor Dr. M Prasanthi, Associate Professor Mr. S Veerabrahmam, Associate Professor DEPARTMENT MENTORING COMMITTEE (DMC) Responsibilities Design and implement a structured mentoring program tailored to the needs of engineering students. Define clear objectives, roles, and responsibilities for mentors and mentees. Assign mentors to students, ensuring an appropriate mentor-to-mentee ratio. Organize training programs to enhance mentors’ skills in counseling, career guidance, and communication. Provide mentors with resources, such as mentoring handbooks and tools, to support their roles effectively Collect and analyze feedback from mentors and mentees to assess program effectiveness. Ensure students receive personalized guidance in academics, career planning, and personal development. Facilitate networking opportunities for students to connect with alumni and industry professionals. Maintain records of mentor-mentee meetings, feedback, and progress reports. Submit periodic reports on the mentoring program’s outcomes to the Head of the Institution Identify gaps and challenges in the mentoring program and propose solutions. Collaborate with department heads, faculty, and administrative staff to align mentoring activities with institutional goals. Committee Members Dr. V Krishna, Professor, HOD, Chairperson Dr. U V Subbarao, Professor Dr. A Anand Kumar, Assistant Professor Mr. P Mahesh, Assistant Professor Mrs. V K Mahalakshmi, Assistant Professor DEPARTMENT LIBRARY COMMITTEE (DLC): Responsibilities Prepare a list of books of relevance and also of Journals/magazines with price for getting them to Library. Obtain necessary approval and plan for procurement. Intimate students/staff regarding availability and new arrivals on regular basis. Maintain accession register and issue register. Committee Members Dr. V Krishna, Professor, HOD, Chairperson Mr. T Venkata Raju, Assistant Professor, Librarian Ms. B Mohini Devi, Assistant Professor Mrs. K Sarada, Assistant Professor CURRICULAM DELIVARY MONITORING COMMITTEE (CDMC) Responsibilities Monitor course delivery and syllabus completion. Recommend curriculum updates aligning with industry trends and OBE principles. Collect and review course outcomes (COs) mapping and attainment data. Submit quarterly curriculum monitoring reports to IQAC and BoS. Coordinate with examination cell to ensure evaluation aligns with outcomes. Committee Members Dr. V Krishna Professor, HOD, Chairperson Dr. NVVS Suryanarayana Professor Dr. V Seetharama Raju  Associate Professor Mrs. M Rama Chaitanya  Assistant Professor Mrs. R D Jyothsna  Assistant Professor Mr. S Veerabrahmam  Assistant Professor ×"
}