{
  "url": "https://nsrit.edu.in/s-h/s-h-publications/",
  "title": "S & H Publications - NSRIT",
  "content": "Search for: S & H Publications NSRIT > S & H > S & H Publications Dept Profile Faculty List Faculty Participations & Achievements Student’s Corner Academic Toppers Professional Societies – Activities SH-Skill Oriented Courses Co-Curricular Activities Extracurricular Activities S & H Laboratories Department Administration Research Activities Publications Learning Resources SH-Materials SH-Self Reflection Videos Department Gallery Contact Us Faculty Publications Faculty Publications 2018-19 Department of Science and Humanities Faculty Publications 2018-19 S. No. Name of the Faculty Title of the Paper Published in, Publisher and ISBN/ISSN Level & Type            ( IJ/NJ/                       IC/NC) Month & Year 1 Dr. V. Krishna Reactions of Polyhomofunctional Organic Compounds: 3. Kinetics of Hydrolysis of 1,2-bis (salicylidinimino) Ethane Proceedings of the National Academy of Sciences, India Section A: Physical Sciences SPRINGER , IJ Dec- 2018 2 Dr. K.S.D.L.K. Prasad Solar UV Index and its dependence on totalozone for Indian stations IJRADT IJ NOV-2018 3 Dr. K.S.D.L.K. Prasad Average Ozone concentration during earthquake at new delhi IJIRI IJ SEP-2018 4 M.G. Vara Prasad “Coding theory on companion matrix for the fibonacc1 λ numbers International journal of mathematical IJ NOV-2018 5 M.G. Vara Prasad Digital signature scheme using golden matrics based on matrix extension of RSA Cryptosystem International journal of mathematical IJ JUN-2019 6 E.Madhavi Impact Of Sugarcane (Saccharum Officinarum L) Industry Effluents On Surface Water Quality Of Sarada River, Visakhapatnam District, Andhra Pradesh, India Journal of Global Biosciences NJ March-2019 Faculty Publications 2017-18 Faculty Publications 2017-18 S. No. Name of the Faculty Title of the Paper Published in, Publisher and ISBN/ISSN Level & Type            ( IJ/NJ/                       IC/NC) Month & Year 1 Dr. V. Krishna Synthesis, Characterization and DNA cleavage studies of isomeric pyridyl-tetrazole Ni(II) and Zn(II) complexes Journal of Saudi Chemical Society, Elsevier IJ AUG-2017 2 Dr. V. Krishna Synthesis and Spectral Characterization  of Antimicrobial Activity of the Binuclear Ni(II), Co(II), Cu(II) and Zn(II) Complexes of A novel Macrocyclclic Biphenyl Bridged Schiff Base Ligand Rasayan J. Chem IJ Sep-2017 3 M.G. Vara Prasad Symmetric Key Generation Algorithm in Linear Block Cipher Over LU Decompostion Method IJTSRD IJ JUNE-2017 4 Dr. B. Syam Kumar Access to drinking water sources, water- born disease prevalence and water purification methods adopted by tribes of Visakhapatnam District, Andhra Pradesh, India.” International Journal of Engineering Sciences & Research Technology IJ May-2017 5 E. Madhavi Assessement Of Soil Quality Under Rice (Oryza Sativa) Cropping Systems, Yelamanchili Mandal, Visakhapatnam District, Andhra Pradesh, India Journal of Pharmaceutical, Chemical and Biological Sciences NJ June 24, 2018 Faculty Publications 2016-17 Faculty Publications 2016-17 S. No. Name of the Faculty Title of the Paper Published in, Publisher and ISBN/ISSN Level & Type            ( IJ/NJ/                       IC/NC) Month & Year 1 Dr.B. Syam kumar Microbiological Quality of Available Water Sources in and around Tribal Areas of Araku Valley Mandal, Visakhapatnam District, Andhra Pradesh, India, 2319–1414 IJ – Research Article December-2016 2 Dr.B. Syam kumar A study on Physico – chemical quality of Drinking water from different sources in Pre and Post monsoon by using water quality index method in Ananthagiri Mandal of Visakhapatnam District, Andhra Pradesh, India 0975-833X. IJ – Research Article 2016 3 Dr.B. Syam kumar A Study on Physico-chemical and Microbiological Quality of Drinking Water in Tribal Area of Hukumpeta Mandal, Visakhapatnam District, Andhra Pradesh, India. 2319-7706 IJ – Research Article 2016 4 Dr.B. Syam kumar Assessment  of  Physico-chemical  quality of  Drinking water  and    water quality index in Tribal  area  of Dumbriguda Mandal, of  Visakhapatnam   District, Andhra Pradesh,India 2230-9926 IJ – Research Article August, 2016 5 N.Giridhar Babu EDXRF-An Analytical Technique for elemental studies in Multidisciplinary research ETAC-2016 IC- Research Article Sept-2016 6 M.G.Varaprasad Generalised Self-Invertible Key generation Algorithm by using reflection matrix in Hill cipher and Affine hill cipher 22207-2214 IJ – Research Article Oct 2016 7 M.G.Varaprasad Some technique algorithm of extension of Affine cipher crypto system using residue modulo prime number 2455-7102 IJ – Research Article Dec 2016 8 M.G.Varaprasad Symetric Key Generation Algorithm in  linear block ciper over LU Decomposition Method 2456-6470 NJ – Research Article May-2017 9 Dr.B. Syam kumar “Access to drinking water sources, water-borne disease prevalence and water purification methods adopted by tribes of Visakhapatnam District, Andhra Pradesh, India 2277-9655 IJ – Research Article May-2017 Faculty Publications 2023-24 Faculty Publications 2024-25 Publications ×"
}