{
  "description": "Nadimpalli Satyanarayana Raju Institute of Technology (Formerly Known as VITS College of Engineering) was established in the year 2008 by Sree Veera Venkata Satyanarayana Educational Society. NSRIT offers quality education and technical competencies on the strong foundation of values, ideals and rich culture to the students across the country and beyond. NSRIT attempts to integrate classroom learning with industry exposure to ensure the application of knowledge during the course of study it self. The objective is to prepare young students to act as leaders for the promotion of the economic and industrial growth of the country and to play a creative role in society.",
  "history": "Nadimpalli Satyanarayana Raju Institute of Technology (Formerly Known as VITS College of Engineering) was established in the year 2008 by Sree Veera Venkata Satyanarayana Educational Society. We focus on imparting skills on cutting – edge technologies to our students. Quality research in the areas of science and technology is given considerable importance here. Our major strength comes by forging strong industry – academic linkage. The institute celebrates freedom of taught, cultivates vision and encourages growth and also inculcates human values and concern for the environment and society.",
  "vision": "To promote societal empowerment and become an institution of excellence in the field of engineering education and research.",
  "mission": [
    "M1 : To develop the students into outstanding professionals through innovative Teaching-Learning process.",
    "M2 : To uphold research through long term Academia-Industry interaction.",
    "M3 : To inculcate ethical standards and moral values."
  ],
  "qualityPolicy": [
    "We at NSRIT, strive to bring out and nurture the talents and skills of youth with Quality Technical Education, motivate them to be self-disciplined and develop their competence to face the challenges of globalization.",
    "Provide value-based education with ancient wisdom and global awareness.",
    "Produce Industry-ready Professionals through training in Soft-Skills and Personality development.",
    "Undertaking networking with Industry, Academic and Research Institutions.",
    "Provide State-of-Art infrastructure for academic and research activities.",
    "Organize national and International Seminars/Conferences.",
    "Promote Creativity and Innovation among students.",
    "Ensure 100% Placements.",
    "Conduct Career -Vision program to facilitate right career choice by students.",
    "Encourage Entrepreneurship among students.",
    "Motivate the students to participation in Co-curricular and Extra-curricular activities.",
    "Train teachers in modern instructional methodologies to improve their teaching skills.",
    "Motivate the faculty to publish papers in National/International Conferences and Journals.",
    "Provide Hostel and Residential accommodation to all students and staff.",
    "Develop and promote Green Environment.",
    "Provide quality environment and services to all Stakeholders.",
    "Maintain global standards in Education, Training and Services.",
    "Both teach and follow Ethical, Environmentally responsible Engineering practice.",
    "Attention to issues of national relevance as well as of Global concern.",
    "Responding to the changes both in Technology and Applications.",
    "Provide systems, resources and opportunities for continuous improvement."
  ],
  "whyNSRIT": [
    "Accredited by NAAC with ‘A’ grade",
    "NBA accredited programs (CSE, ECE, Mech. Engg.)",
    "QS I-Gauge certified institution",
    "Recognized as “A” Grade Institute by Govt of Andhra Pradesh",
    "100% admission with scholarship schemes based on EAPCET ranks",
    "Industry sponsored laboratories",
    "B.Tech (Minor) in AI, ML, and Data Science",
    "Part-time B.Tech for working professionals",
    "Placements up to Rs. 39 LPA",
    "Hire and train model for premium offers",
    "Internships with PPOs and stipends from 3rd year",
    "Strong industry connect and On Job Training (OJT)",
    "Innovative clubs and Startup Bootcamp (Idea Clinic)",
    "Professional affiliations: ACM, ASME, SAE, ISTE, IEEE, CSI, IE(I)",
    "300 Mbps hi-speed internet connectivity",
    "Ragging free environment"
  ],
  "strategicDocuments": {
    "strategicPlan": "https://nsrit.edu.in/wp-content/uploads/2025/12/Strategic-Plan.pdf",
    "strategicPriorities": "https://nsrit.edu.in/wp-content/uploads/2026/01/Strategic-Priorities.pdf",
    "stakeholderEngagementFramework": "https://nsrit.edu.in/wp-content/uploads/2026/01/Stakeholder-engagment-framework.pdf",
    "institutionalPerformanceIndicators": "https://nsrit.edu.in/wp-content/uploads/2026/01/Institutional-Performance-Indicators.pdf"
  }
}
